[{"title":"A Fine Balance","author":"Rohinton Mistry","description":"Set in mid-1970s India, a subtle and compelling narrative about four unlikely characters who come together in circumstances no one could have foreseen soon after the government declares a 'State of Internal Emergency'. It is a breathtaking achievement: panoramic yet humane, intensely political yet rich with local delight.","categories":["Apartment houses"],"coverImage":"http://books.google.com/books/content?id=C4A7PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Good Earth","author":"Pearl S. Buck","description":"A Chinese peasant overcomes the forces of nature and the frailties of human nature to become a wealthy landowner.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=U6OgdLXPwvAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Bluest Eye","author":"Toni Morrison","description":"NATIONAL BESTSELLER • A PARADE BEST BOOK OF ALL TIME • From the acclaimed Nobel Prize winner—a powerful examination of our obsession with beauty and conformity that asks questions about race, class, and gender with characteristic subtly and grace. In Morrison’s acclaimed first novel, Pecola Breedlove—an 11-year-old Black girl in an America whose love for its blond, blue-eyed children can devastate all others—prays for her eyes to turn blue: so that she will be beautiful, so that people will look at her, so that her world will be different. This is the story of the nightmare at the heart of her yearning, and the tragedy of its fulfillment. Here, Morrison’s writing is “so precise, so faithful to speech and so charged with pain and wonder that the novel becomes poetry” (The New York Times).","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=12_KUGLXigMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Corrections","author":"Jonathan Franzen","description":"Winner of the 2001 National Book Award for Fiction Nominated for the National Book Critics Circle Award An American Library Association Notable Book Jonathan Franzen's third novel, The Corrections, is a great work of art and a grandly entertaining overture to our new century: a bold, comic, tragic, deeply moving family drama that stretches from the Midwest at mid-century to Wall Street and Eastern Europe in the age of greed and globalism. Franzen brings an old-time America of freight trains and civic duty, of Cub Scouts and Christmas cookies and sexual inhibitions, into brilliant collision with the modern absurdities of brain science, home surveillance, hands-off parenting, do-it-yourself mental healthcare, and the anti-gravity New Economy. With The Corrections, Franzen emerges as one of our premier interpreters of American society and the American soul. Enid Lambert is terribly, terribly anxious. Although she would never admit it to her neighbors or her three grown children, her husband, Alfred, is losing his grip on reality. Maybe it's the medication that Alfred takes for his Parkinson's disease, or maybe it's his negative attitude, but he spends his days brooding in the basement and committing shadowy, unspeakable acts. More and more often, he doesn't seem to understand a word Enid says. Trouble is also brewing in the lives of Enid's children. Her older son, Gary, a banker in Philadelphia, has turned cruel and materialistic and is trying to force his parents out of their old house and into a tiny apartment. The middle child, Chip, has suddenly and for no good reason quit his exciting job as a professor at D------ College and moved to New York City, where he seems to be pursuing a \"transgressive\" lifestyle and writing some sort of screenplay. Meanwhile the baby of the family, Denise, has escaped her disastrous marriage only to pour her youth and beauty down the drain of an affair with a married man--or so Gary hints. Enid, who loves to have fun, can still look forward to a final family Christmas and to the ten-day Nordic Pleasurelines Luxury Fall Color Cruise that she and Alfred are about to embark on. But even these few remaining joys are threatened by her husband's growing confusion and unsteadiness. As Alfred enters his final decline, the Lamberts must face the failures, secrets, and long-buried hurts that haunt them as a family if they are to make the corrections that each desperately needs.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=FodGfz5li5wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Love in the Time of Cholera (Illustrated Edition)","author":"Gabriel García Márquez","description":"A beautifully packaged edition of one of García Márquez's most beloved novels, with never-before-seen color illustrations by the Chilean artist Luisa Rivera and an interior design created by the author's son, Gonzalo García Barcha. In their youth, Florentino Ariza and Fermina Daza fall passionately in love. When Fermina eventually chooses to marry a wealthy, well-born doctor, Florentino is devastated, but he is a romantic. As he rises in his business career he whiles away the years in 622 affairs—yet he reserves his heart for Fermina. Her husband dies at last, and Florentino purposefully attends the funeral. Fifty years, nine months, and four days after he first declared his love for Fermina, he will do so again.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=QgIHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Sound and the Fury","author":"William Faulkner","description":"The Sound and the Fury is the tragedy of the Compson family, featuring some of the most memorable characters in literature: beautiful, rebellious Caddy; the manchild Benjy; haunted, neurotic Quentin; Jason, the brutal cynic; and Dilsey, their black servant. Their lives fragmented and harrowed by history and legacy, the character’s voices and actions mesh to create what is arguably Faulkner’s masterpiece and one of the greatest novels of the twentieth century. “I give you the mausoleum of all hope and desire. . . . I give it to you not that you may remember time, but that you might forget it now and then for a moment and not spend all of your breath trying to conquer it. Because no battle is ever won he said. They are not even fought. The field only reveals to man his own folly and despair, and victory is an illusion of philosophers and fools.” —from The Sound and the Fury","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=m0RaQItCiCUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Light in August","author":"William Faulkner","description":"DigiCat Publishing presents to you this special edition of \"Light in August\" by William Faulkner. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=7ot_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"As I Lay Dying","author":"William Faulkner","description":"DigiCat Publishing presents to you this special edition of \"As I Lay Dying\" by William Faulkner. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=jU1_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Tiger's Wife","author":"Téa Obreht","description":"NATIONAL BOOK AWARD FINALIST • NEW YORK TIMES BESTSELLER • “Spectacular . . . [Téa Obreht] spins a tale of such marvel and magic in a literary voice so enchanting that the mesmerized reader wants her never to stop.”—Entertainment Weekly Look for Téa Obreht’s second novel, Inland, now available. NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY Michiko Kakutani, The New York Times • Entertainment Weekly • The Christian Science Monitor • The Kansas City Star • Library Journal Weaving a brilliant latticework of family legend, loss, and love, Téa Obreht, the youngest of The New Yorker’s twenty best American fiction writers under forty, has spun a timeless novel that will establish her as one of the most vibrant, original authors of her generation. In a Balkan country mending from war, Natalia, a young doctor, is compelled to unravel the mysterious circumstances surrounding her beloved grandfather’s recent death. Searching for clues, she turns to his worn copy of The Jungle Book and the stories he told her of his encounters over the years with “the deathless man.” But most extraordinary of all is the story her grandfather never told her—the legend of the tiger’s wife. NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The Wall Street Journal • O: The Oprah Magazine • The Economist • Vogue • Slate • Chicago Tribune • The Seattle Times • Dayton Daily News • Publishers Weekly • Alan Cheuse, NPR’s All Things Considered “Stunning . . . a richly textured and searing novel.”—Michiko Kakutani, The New York Times “[Obreht] has a talent for subtle plotting that eludes most writers twice her age, and her descriptive powers suggest a kind of channeled genius. . . . No novel [this year] has been more satisfying.”—The Wall Street Journal “Filled with astonishing immediacy and presence, fleshed out with detail that seems firsthand, The Tiger’s Wife is all the more remarkable for being the product not of observation but of imagination.”—The New York Times Book Review “That The Tiger’s Wife never slips entirely into magical realism is part of its magic. . . . Its graceful commingling of contemporary realism and village legend seems even more absorbing.”—The Washington Post","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=49Z7_FUGVjsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Cry, the Beloved Country","author":"Alan Paton","description":"Cry the Beloved Country is the deeply moving story of the Zulu pastor Stephen Kumalo and his son Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its contemporaneity, unforgettable for character and incident, Cry the Beloved Country is a classic work of love and hope, courage and endurance, born of the dignity of man.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=bHxyrMfxzwUC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"She's Come Undone","author":"Wally Lamb","description":"Meet Dolores Price. She's thirteen, wise-mouthed but wounded. Beached like a whale in front of her bedroom TV, she spends the next few years nourishing herself with the chocolate, crisps and Pepsi her anxious mother supplies. When she finally rolls into young womanhood at 257 pounds, Dolores is no stronger and life is no kinder. But this time she's determined to rise to the occasion and give herself one more chance before really going belly up. In his extraordinary coming-of-age odyssey, Wally Lamb invites us to hitch an incredible ride on a journey of love, pain, and renewal with the most heartbreakingly comical heroine to come along in years. At once a fragile girl and a hard-edged cynic, so tough to love yet so inimitably loveable, Dolores is as poignantly real as our own imperfections.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=u7zm2XdT214C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Freedom","author":"Jonathan Franzen","description":"Patty and Walter Berglund were the new pioneers of old St. Paul—the gentrifiers, the hands-on parents, the avant-garde of the Whole Foods generation. Patty was the ideal sort of neighbor, who could tell you where to recycle your batteries and how to get the local cops to actually do their job. She was an enviably perfect mother and the wife of Walter's dreams. Together with Walter—environmental lawyer, commuter cyclist, total family man—she was doing her small part to build a better world. But now, in the new millennium, the Berglunds have become a mystery. Why has their teenage son moved in with the aggressively Republican family next door? Why has Walter taken a job working with Big Coal? What exactly is Richard Katz—outré rocker and Walter's college best friend and rival—still doing in the picture? Most of all, what has happened to Patty? Why has the bright star of Barrier Street become \"a very different kind of neighbor,\" an implacable Fury coming unhinged before the street's attentive eyes? In his first novel since The Corrections, Jonathan Franzen has given us an epic of contemporary love and marriage. Freedom comically and tragically captures the temptations and burdens of liberty: the thrills of teenage lust, the shaken compromises of middle age, the wages of suburban sprawl, the heavy weight of empire. In charting the mistakes and joys of Freedom's characters as they struggle to learn how to live in an ever more confusing world, Franzen has produced an indelible and deeply moving portrait of our time.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=cWQJJIgJNtUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Poisonwood Bible","author":"Barbara Kingsolver","description":"New York Times Bestseller • Finalist for the Pulitzer Prize • An Oprah's Book Club Selection “Powerful . . . [Kingsolver] has with infinitely steady hands worked the prickly threads of religion, politics, race, sin and redemption into a thing of terrible beauty.” —Los Angeles Times Book Review The Poisonwood Bible, now celebrating its 25th anniversary, established Barbara Kingsolver as one of the most thoughtful and daring of modern writers. Taking its place alongside the classic works of postcolonial literature, it is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in Africa. The story is told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it—from garden seeds to Scripture—is calamitously transformed on African soil. The novel is set against one of the most dramatic political chronicles of the twentieth century: the Congo's fight for independence from Belgium, the murder of its first elected prime minister, the CIA coup to install his replacement, and the insidious progress of a world economic order that robs the fledgling African nation of its autonomy. Against this backdrop, Orleanna Price reconstructs the story of her evangelist husband's part in the Western assault on Africa, a tale indelibly darkened by her own losses and unanswerable questions about her own culpability. Also narrating the story, by turns, are her four daughters—the teenaged Rachel; adolescent twins Leah and Adah; and Ruth May, a prescient five-year-old. These sharply observant girls, who arrive in the Congo with racial preconceptions forged in 1950s Georgia, will be marked in surprisingly different ways by their father's intractable mission, and by Africa itself. Ultimately each must strike her own separate path to salvation. Their passionately intertwined stories become a compelling exploration of moral risk and personal responsibility.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=Q69PhJN-TbwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Middlesex","author":"Jeffrey Eugenides","description":"Spanning eight decades and chronicling the wild ride of a Greek-American family through the vicissitudes of the twentieth century, Jeffrey Eugenides’ witty, exuberant novel on one level tells a traditional story about three generations of a fantastic, absurd, lovable immigrant family -- blessed and cursed with generous doses of tragedy and high comedy. But there’s a provocative twist. Cal, the narrator -- also Callie -- is a hermaphrodite. And the explanation for this takes us spooling back in time, through a breathtaking review of the twentieth century, to 1922, when the Turks sacked Smyrna and Callie’s grandparents fled for their lives. Back to a tiny village in Asia Minor where two lovers, and one rare genetic mutation, set our narrator’s life in motion. Middlesex is a grand, utterly original fable of crossed bloodlines, the intricacies of gender, and the deep, untidy promptings of desire. It’s a brilliant exploration of divided people, divided families, divided cities and nations -- the connected halves that make up ourselves and our world.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=rUHHbYhlIxYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"I Know This Much Is True","author":"Wally Lamb","description":"With his stunning debut novel, She's Come Undone, Wally Lamb won the adulation of critics and readers with his mesmerizing tale of one woman's painful yet triumphant journey of self-discovery. Now, this brilliantly talented writer returns with I Know This Much Is True, a heartbreaking and poignant multigenerational saga of the reproductive bonds of destruction and the powerful force of forgiveness. A masterpiece that breathtakingly tells a story of alienation and connection, power and abuse, devastation and renewal--this novel is a contemporary retelling of an ancient Hindu myth. A proud king must confront his demons to achieve salvation. Change yourself, the myth instructs, and you will inhabit a renovated world. When you're the same brother of a schizophrenic identical twin, the tricky thing about saving yourself is the blood it leaves on your bands--the little inconvenience of the look-alike corpse at your feet. And if you're into both survival of the fittest and being your brother's keeper--if you've promised your dying mother--then say so long to sleep and hello to the middle of the night. Grab a book or a beer. Get used to Letterman's gap-toothed smile of the absurd, or the view of the bedroom ceiling, or the influence of random selection. Take it from a godless insomniac. Take it from the uncrazy twin--the guy who beat the biochemical rap. Dominick Birdsey's entire life has been compromised and constricted by anger and fear, by the paranoid schizophrenic twin brother he both deeply loves and resents, and by the past they shared with their adoptive father, Ray, a spit-and-polish ex-Navy man (the five-foot-six-inch sleeping giant who snoozed upstairs weekdays in the spare room and built submarines at night), and their long-suffering mother, Concettina, a timid woman with a harelip that made her shy and self-conscious: She holds a loose fist to her face to cover her defective mouth--her perpetual apology to the world for a birth defect over which she'd had no control. Born in the waning moments of 1949 and the opening minutes of 1950, the twins are physical mirror images who grow into separate yet connected entities: the seemingly strong and protective yet fearful Dominick, his mother's watchful \"monkey\"; and the seemingly weak and sweet yet noble Thomas, his mother's gentle \"bunny.\" From childhood, Dominick fights for both separation and wholeness--and ultimately self-protection--in a house of fear dominated by Ray, a bully who abuses his power over these stepsons whose biological father is a mystery. I was still afraid of his anger but saw how he punished weakness--pounced on it. Out of self-preservation I hid my fear, Dominick confesses. As for Thomas, he just never knew how to play defense. He just didn't get it. But Dominick's talent for survival comes at an enormous cost, including the breakup of his marriage to the warm, beautiful Dessa, whom he still loves. And it will be put to the ultimate test when Thomas, a Bible-spouting zealot, commits an unthinkable act that threatens the tenuous balance of both his and Dominick's lives. To save himself, Dominick must confront not only the pain of his past but the dark secrets he has locked deep within himself, and the sins of his ancestors--a quest that will lead him beyond the confines of his blue-collar New England town to the volcanic foothills of Sicily 's Mount Etna, where his ambitious and vengefully proud grandfather and a namesake Domenico Tempesta, the sostegno del famiglia, was born. Each of the stories Ma told us about Papa reinforced the message that he was the boss, that he ruled the roost, that what he said went. Searching for answers, Dominick turns to the whispers of the dead, to the pages of his grandfather's handwritten memoir, The History of Domenico Onofrio Tempesta, a Great Man from Humble Beginnings. Rendered with touches of magic realism, Domenico's fablelike tale--in which monkeys enchant and religious statues weep--becomes the old man's confession--an unwitting legacy of contrition that reveals the truth's of Domenico's life, Dominick learns that power, wrongly used, defeats the oppressor as well as the oppressed, and now, picking through the humble shards of his deconstructed life, he will search for the courage and love to forgive, to expiate his and his ancestors' transgressions, and finally to rebuild himself beyond the haunted shadow of his twin. Set against the vivid panoply of twentieth-century America and filled with richly drawn, memorable characters, this deeply moving and thoroughly satisfying novel brings to light humanity's deepest needs and fears, our aloneness, our desire for love and acceptance, our struggle to survive at all costs. Joyous, mystical, and exquisitely written, I Know This Much Is True is an extraordinary reading experience that will leave no reader untouched.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=v9uqxTiOxq8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Great Expectations","author":"Charles Dickens","description":"A young man in 1820s London who expects to be reared by a rich patron and to marry a wealthy young woman finds his hopes dashed.","categories":["Benefactors"],"coverImage":"http://books.google.com/books/content?id=tfC_rQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"While I Was Gone","author":"Sue Miller","description":"The \"New York Times\" bestseller called \"quietly gripping\" by \"USA Today\" demonstrates how impulses can fracture even the most stable family. Despite her loving family and beautiful home, Jo Becker is restless. Then an old roommate reappears, bringing back Jo's memories of her early 20s. Jo's obsession with that period in her life--and the crime that ended it--draws her back to a horrible secret.","categories":["English fiction"],"coverImage":"http://books.google.com/books/content?id=syDpisFWOIsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"There Are More Beautiful Things Than Beyonce","author":"Morgan Parker","description":"A TIME Magazine Best Paperback of 2017 A Publishers Weekly Best Poetry Collection of Spring A Paris Review Staff Pick A Most Anticipated Book of 2017 at NPR.org, BuzzFeed, VICE, NYLON, and more \"This is a marvelous book. See for yourself. Morgan Parker is a fearlessly forward and forward-thinking literary star.\" —Terrance Hayes The only thing more beautiful than Beyoncé is God, and God is a black woman sipping rosé and drawing a lavender bath, texting her mom, belly-laughing in the therapist’s office, feeling unloved, being on display, daring to survive. Morgan Parker stands at the intersections of vulnerability and performance, of desire and disgust, of tragedy and excellence. Unrelentingly feminist, tender, ruthless, and sequined, these poems are an altar to the complexities of black American womanhood in an age of non-indictments and deja vu, and a time of wars over bodies and power. These poems celebrate and mourn. They are a chorus chanting: You’re gonna give us the love we need.","categories":["Poetry"],"coverImage":"http://books.google.com/books/content?id=QmUPDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Fall On Your Knees","author":"Ann-Marie MacDonald","description":"The Piper family is steeped in secrets, lies, and unspoken truths. At the eye of the storm is one secret that threatens to shake their lives -- even destroy them. Set on stormy Cape Breton Island off Nova Scotia, Fall on Your Knees is an internationally acclaimed multigenerational saga that chronicles the lives of four unforgettable sisters. Theirs is a world filled with driving ambition, inescapable family bonds, and forbidden love. Compellingly written, by turns menacingly dark and hilariously funny, this is an epic tale of five generations of sin, guilt, and redemption.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=JSpbbA1zyz4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"White Oleander","author":"Janet Fitch","description":"The unforgettable story of a young woman's odyssey through a series of Los Angeles foster homes on her journey to redemption. Astrid is the only child of a single mother, Ingrid, a brilliant, obsessed poet who wields her luminous beauty to intimidate and manipulate men. Astrid worships her mother and cherishes their private world full of ritual and mystery - but their idyll is shattered when Astrid's mother falls apart over a lover. Deranged by rejection, Ingrid murders the man, and is sentenced to life in prison. White Oleander is the unforgettable story of Astrid's journey through a series of foster homes and her efforts to find a place for herself in impossible circumstances. Each home is its own universe, with a new set of laws and lessons to be learned. With determination and humor, Astrid confronts the challenges of loneliness and poverty, and strives to learn who a motherless child in an indifferent world can become. Oprah Winfrey enjoyed this gripping first novel so much that she not only made it her book club pick, she asked if she could narrate the audio release.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=MulNRdtMx9YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Vinegar Hill","author":"A. Manette Ansay","description":"In a stark, troubling, yet ultimately triumphant celebration of self-determination, award-winning author A. Manette Ansay re-creates a stifling world of guilty and pain, and the tormented souls who inhabit it. It is 1972 when circumstance carries Ellen Grier and her family back to Holly's Field, Wisconsin. Dutifully accompanying her newly unemployed husband, Ellen has brought her two children into the home of her in-laws on Vinegar Hill--a loveless house suffused with the settling dust of bitterness and routine--where calculated cruelty is a way of life preserved and perpetuated in the service of a rigid, exacting and angry God. Behind a facade of false piety, there are sins and secrets in this place that could crush a vibrant young woman's passionate spirit. And here Ellen must find the straight to endure, change, and grow in the all-pervading darkness that threatens to destroy everything she is and everyone she loves.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=F_dmQ0HC1bwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Water Dancer","author":"Ta-Nehisi Coates","description":"#1 NEW YORK TIMES BESTSELLER • OPRAH’S BOOK CLUB PICK • From the National Book Award–winning author of Between the World and Me, a boldly conjured debut novel about a magical gift, a devastating loss, and an underground war for freedom. “This potent book about America’s most disgraceful sin establishes [Ta-Nehisi Coates] as a first-rate novelist.”—San Francisco Chronicle IN DEVELOPMENT AS A MAJOR MOTION PICTURE • Adapted by Ta-Nehisi Coates and Kamilah Forbes, directed by Nia DaCosta, and produced by MGM, Plan B, and Oprah Winfrey’s Harpo Films NOMINATED FOR THE NAACP IMAGE AWARD • NAMED ONE OF PASTE’S BEST NOVELS OF THE DECADE • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY Time • NPR • The Washington Post • Chicago Tribune • Vanity Fair • Esquire • Good Housekeeping • Paste • Town & Country • The New York Public Library • Kirkus Reviews • Library Journal Young Hiram Walker was born into bondage. When his mother was sold away, Hiram was robbed of all memory of her—but was gifted with a mysterious power. Years later, when Hiram almost drowns in a river, that same power saves his life. This brush with death births an urgency in Hiram and a daring scheme: to escape from the only home he’s ever known. So begins an unexpected journey that takes Hiram from the corrupt grandeur of Virginia’s proud plantations to desperate guerrilla cells in the wilderness, from the coffin of the Deep South to dangerously idealistic movements in the North. Even as he’s enlisted in the underground war between slavers and the enslaved, Hiram’s resolve to rescue the family he left behind endures. This is the dramatic story of an atrocity inflicted on generations of women, men, and children—the violent and capricious separation of families—and the war they waged to simply make lives with the people they loved. Written by one of today’s most exciting thinkers and writers, The Water Dancer is a propulsive, transcendent work that restores the humanity of those from whom everything was stolen. Praise for The Water Dancer “Ta-Nehisi Coates is the most important essayist in a generation and a writer who changed the national political conversation about race with his 2015 memoir, Between the World and Me. So naturally his debut novel comes with slightly unrealistic expectations—and then proceeds to exceed them. The Water Dancer . . . is a work of both staggering imagination and rich historical significance. . . . What’s most powerful is the way Coates enlists his notions of the fantastic, as well as his fluid prose, to probe a wound that never seems to heal. . . . Timeless and instantly canon-worthy.”—Rolling Stone","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=g08EEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Gap Creek","author":"Robert Morgan","description":"A New York Times Bestseller & Oprah's Book Club Pick Young Julie Harmon works “hard as a man,” they say, so hard that at times she’s not sure she can stop. People depend on her to slaughter the hogs and nurse the dying. People are weak, and there is so much to do. At just seventeen she marries and moves down into the valley of Gap Creek, where perhaps life will be better. But Julie and Hank’s new life in the valley, in the last years of the nineteenth century, is more complicated than the couple ever imagined. Sometimes it’s hard to tell what to fear most—the fires and floods or the flesh-and-blood grifters, drunks, and busybodies who insinuate themselves into their new life. To survive, they must find out whether love can keep chaos and madness at bay. Their struggles with nature, with work, with the changing century, and with the disappointments and triumphs of their union make Gap Creek a timeless story of a marriage.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=MpDqIm6nAsAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Rapture of Canaan","author":"Sheri Reynolds","description":"Ninah Huff, the teenage granddaughter of the founder of an isolated religious community, causes controversy when she is discovered to be pregnant with what she claims is a holy child","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=zDinkyCJOSoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Deep End of the Ocean","author":"Jacquelyn Mitchard","description":"\"Masterful...A big story about human connection and emotional survival\" - Los Angeles Times The first book ever chosen by Oprah's Book Club Few first novels receive the kind of attention and acclaim showered on this powerful story—a nationwide bestseller, a critical success, and the first title chosen for Oprah's Book Club. Both highly suspenseful and deeply moving, The Deep End of the Ocean imagines every mother's worst nightmare—the disappearance of a child—as it explores a family's struggle to endure, even against extraordinary odds. Filled with compassion, humor, and brilliant observations about the texture of real life, here is a story of rare power, one that will touch readers' hearts and make them celebrate the emotions that make us all one.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=YOoHa7VCJ8MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"What Looks Like Crazy On an Ordinary Day","author":"Pearl Cleage","description":"After a decade of elegant pleasures and luxe living with the Atlanta brothers and sisters with the best clothes and biggest dreams, Ava Johnson has temporarily returned home to Idlewild—her fabulous career and power plans smashed to bits by cold reality. But what she imagines to be the end is, instead, a beginning. Because, in the ten-plus years since Ava left, all the problems of the big city have come to roost in the sleepy North Michigan community whose ordinariness once drove her away; and she cannot turn her back on friends and family who sorely need her in the face of impending trouble and tragedy. Besides which, that one unthinkable, unmistakable thing is now happening to her: Ava Johnson is falling in love. Acclaimed playwright, essayist, New York Times bestselling author, and columnist Pearl Cleage has created a world rich in character, human drama, and deep, compassionate understanding, in a remarkable novel that sizzles with sensuality, hums with gritty truth, and sings and crackles with life-affirming energy.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=RjdW8PLfPAoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Say You're One of Them","author":"Uwem Akpan","description":"An Oprah's Book Club selection: this \"electrifying\" book (Washington Post) pays tribute to the wisdom and resilience of children even in the face of the most agonizing circumstances. Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds, his dream can't be granted. Food comes first. His family lives in a street shanty in Nairobi, Kenya, but their way of both loving and taking advantage of each other strikes a universal chord. In the second of his stories published in a New Yorker special fiction issue, Akpan takes us far beyond what we thought we knew about the tribal conflict in Rwanda. The story is told by a young girl, who, with her little brother, witnesses the worst possible scenario between parents. They are asked to do the previously unimaginable in order to protect their children. This singular collection will also take the reader inside Nigeria, Benin, and Ethiopia, revealing in beautiful prose the harsh consequences for children of life in Africa. Akpan's voice is a literary miracle, rendering lives of almost unimaginable deprivation and terror into stories that are nothing short of transcendent. One of the best books of the year: Wall Street Journal, People, Bloomberg News, Christian Science Monitor, Washington Post Book World, and Entertainment Weekly","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=ZW04WgBbvisC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Twelve Tribes of Hattie","author":"Ayana Mathis","description":"NATIONAL BESTSELLER • AN OPRAH'S BOOK CLUB 2.0 SELECTION • \"A remarkable page-turner of a novel.\" —Chicago Tribune In 1923, fifteen-year-old Hattie Shepherd, swept up by the tides of the Great Migration, flees Georgia and heads north. This \"brutal, illuminating version of the twentieth century African-American experience belongs alongside those of Toni Morrison, Alice Walker and Zora Neale Hurston\" (Newsday). A New York Times Notable Book • An NPR Best Book of the Year • A Buzzfeed Best Book of the Year Full of hope, Hattie settles in Philadelphia to build a better life. Instead she marries a man who will bring her nothing but disappointment, and watches helplessly as her firstborn twins are lost to an illness that a few pennies could have prevented. Hattie gives birth to nine more children, whom she raises with grit, mettle, and not an ounce of the tenderness they crave. She vows to prepare them to meet a world that will not be kind. Their lives, captured here in twelve luminous threads, tell the story of a mother’s monumental courage—and a nation's tumultuous journey.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=DwJVdWgKscwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Breath, Eyes, Memory","author":"Edwidge Danticat","description":"The 20th anniversary edition of Edwidge Danticat's groundbreaking debut, now an established classic--revised and with a new introduction by the author, and including extensive bonus materials At the age of twelve, Sophie Caco is sent from her impoverished Haitian village to New York to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti—to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence. In her stunning literary debut, Danticat evokes the wonder, terror, and heartache of her native Haiti—and the enduring strength of Haiti’s women—with vibrant imagery and narrative grace that bear witness to her people’s suffering and courage.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=sMCJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Songs in Ordinary Time","author":"Mary McGarry Morris","description":"This New York Times bestseller of a troubled family in 1960s Vermont is “teeming with incident and characters, often foolish, even nasty, but always alive” (The New Yorker). It is the summer of 1960 in Atkinson, Vermont. With no help from her alcoholic ex-husband, Marie Fermoyle is raising three children on the edge of poverty. Her seventeen-year-old daughter, Alice, is becoming emotionally involved with a local priest in a staunchly Catholic town that disapproves of Marie’s divorce. Alice’s brother Norm is a hotheaded sixteen-year-old, and twelve-year-old Benjy is isolated and full of anxieties, looking with yearning at the Klubocks next door, who seem to live an orderly, peaceful life much unlike his own family’s. Now, Marie has met a new man: Omar Duvall, who talks about opportunities and riches but so far seems only to sponge off the Fermoyles. A lonely, desperate single mother like Marie is easy prey for con men, but she resists the temptation to doubt him. Young Benjy, though, may eventually reveal a disturbing secret that could shatter all her hopes. A portrait of a family as well as a town and its secrets, Songs in Ordinary Time is “a gritty, beautifully crafted novel rich in wisdom and suspense” (The Miami Herald). An Oprah’s Book Club selection from an author nominated for the National Book Award and the PEN/Faulkner Award, it is “extraordinary . . . a deeply satisfying story” (USA Today).","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=iUM7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Book of Ruth","author":"Jane Hamilton","description":"PEN/Hemingway Award Winner: An “enthralling” novel of a woman trapped within a tragically dysfunctional family (Entertainment Weekly). From the New York Times–bestselling author of The Excellent Lombards and A Map of the World, this is “an extraordinary story of a family’s disintegration [that] will be compared to Jane Smiley’s A Thousand Acres” (People). It follows Ruth Grey, a young woman in a tiny Illinois farm town, who has lost her father to World War II, and constantly faces her unhappy mother’s wrath—when she isn’t being ignored in favor of her math-prodigy brother. As Ruth navigates her lonely life, she strives to find happiness and pleasure where she can, but the world may conspire to defeat her. “A sly and wistful, if harrowing, human comedy . . . [An] original voice in fiction and one well worth listening to.” —The Boston Sunday Globe “Unforgettably, beat by beat, Hamilton maps the best and worst of the human heart and all the mysterious, uncharted country in between.” —Kirkus Reviews “Hamilton’s story builds to a shocking crescendo. Her small-town characters are as appealingly offbeat and brushed with grace as any found in Alice Hoffman’s or Anne Tyler’s novels.” —Glamour","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=Qp7iBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"A Virtuous Woman","author":"Kaye Gibbons","description":"Two unforgettable characters, Jack Ernest Stokes, known as Blinking Jack, and his wife, Ruby Pitt Woodrow Stokes, tell the story of their years together. Jack was forty and Ruby only twenty when they were married. For twenty-five years they lived together, man and wife, until Ruby died of lung cancer. A LITERARY GUILD AND DOUBLEDAY BOOK CLUB selection.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=CVqmrlAMQ7QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Midwives","author":"Chris Bohjalian","description":"NATIONAL BESTSELLER • This modern classic from the author of The Flight Attendant is a compulsively readable novel that explores questions of human responsibility that are as fundamental to our society now as they were when the book was first published. A selection of Oprah's original Book Club that has sold more than two million copies. On an icy winter night in an isolated house in rural Vermont, a seasoned midwife named Sibyl Danforth takes desperate measures to save a baby’s life. She performs an emergency cesarean section on a mother she believes has died of stroke. But what if—as Sibyl's assistant later charges—the patient wasn't already dead? The ensuing trial bears the earmarks of a witch hunt, forcing Sibyl to face the antagonism of the law, the hostility of traditional doctors, and the accusations of her own conscience. Exploring the complex and emotional decisions surrounding childbirth, Midwives engages, moves, and transfixes us as only the very best novels ever do. Look for Chris Bohjalian's new novel, The Lioness!","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=JTyAcjYXi_cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Where the Heart Is","author":"Billie Letts","description":"Talk about unlucky sevens. An hour ago, seventeen-year-old, seven months pregnant Novalee Nation was heading for California with her boyfriend. Now she finds herself stranded at a Wal-Mart in Sequoyah, Oklahoma, with just $7.77 in change. But Novalee is about to discover hidden treasures in this small Southwest town--a group of down-to-earth, deeply caring people willing to help a homeless, jobless girl living secretly in a Wal-Mart. From Bible-thumping blue-haired Sister Thelma Husband to eccentric librarian Forney Hull who loves Novalee more than she loves herself, they are about to take her--and you, too--on a moving, funny, and unforgettable journey to . . . Where the Heart Is.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=Iq05nE7V2rkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Black and Blue","author":"Anna Quindlen","description":"NEW YORK TIMES BESTSELLER • “Intimate and illuminating and, as is true of most anything Quindlen writes, well worth the read.”—People For eighteen years Fran Benedetto kept her secret, hid her bruises. She stayed with Bobby because she wanted her son to have a father, and because, in spite of everything, she loved him. Then one night, when she saw the look on her ten-year-old son’s face, Fran finally made a choice—and ran for both their lives. Now she is starting over in a city far from home, far from Bobby. In this place she uses a name that isn’t hers, watches over her son, and tries to forget. For the woman who now calls herself Beth, every day is a chance to heal, to put together the pieces of her shattered self. And every day she waits for Bobby to catch up to her. Bobby always said he would never let her go, and despite the ingenuity of her escape, Fran Benedetto is certain of one thing: It is only a matter of time. Praise for Black and Blue \"Heartbreaking.\"—Time \"Beautifully paced—keeps the reader anxiously turning the pages.\"—New York Times Book Review \"A gut-wrencher—another stunner.\"—Denver Post \"Impossible to put down—the tension is both awful and mesmerizing.\"—St. Louis Post-Dispatch \"Engrossing—compassionate and tense.\"—New York Times \"Her best novel yet.\"—Publishers Weekly \"Absolutely believable—Quindlen writes with power and grace.\"—Boston Globe \"A moving masterpiece.\"—Lexington Herald-Leader","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=s4P9mAaxTIcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Best Way to Play","author":"Bill Cosby","description":"Little Bill and his friends, avid fans of the television show \"Space Explorers\", clamor to get the video game version, but they find that they have more fun using their imagination while playing outside.","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=owxHPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Drowning Ruth","author":"Christina Schwarz","description":"Deftly written and emotionally powerful, Drowning Ruth is a stunning portrait of the ties that bind sisters together and the forces that tear them apart, of the dangers of keeping secrets and the explosive repercussions when they are exposed. A mesmerizing and achingly beautiful debut. Winter, 1919. Amanda Starkey spends her days nursing soldiers wounded in the Great War. Finding herself suddenly overwhelmed, she flees Milwaukee and retreats to her family's farm on Nagawaukee Lake, seeking comfort with her younger sister, Mathilda, and three-year-old niece, Ruth. But very soon, Amanda comes to see that her old home is no refuge--she has carried her troubles with her. On one terrible night almost a year later, Amanda loses nearly everything that is dearest to her when her sister mysteriously disappears and is later found drowned beneath the ice that covers the lake. When Mathilda's husband comes home from the war, wounded and troubled himself, he finds that Amanda has taken charge of Ruth and the farm, assuming her responsibility with a frightening intensity. Wry and guarded, Amanda tells the story of her family in careful doses, as anxious to hide from herself as from us the secrets of her own past and of that night. Ruth, haunted by her own memory of that fateful night, grows up under the watchful eye of her prickly and possessive aunt and gradually becomes aware of the odd events of her childhood. As she tells her own story with increasing clarity, she reveals the mounting toll that her aunt's secrets exact from her family and everyone around her, until the heartrending truth is uncovered. Guiding us through the lives of the Starkey women, Christina Schwarz's first novel shows her compassion and a unique understanding of the American landscape and the people who live on it.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=Hdn0sVWOPhwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Pilot's Wife","author":"Anita Shreve","description":"Anita Shreve's hauntingly beautiful #1 bestseller and Oprah's Book Club selection about tragedy, grief, betrayal, and the 'impossibility of knowing another person.' As a pilot's wife, Kathryn has learned to expect both intense exhilaration and long periods alone, but nothing has prepared her for a late-night knock that lets her know her husband has died in a crash. Until now, Kathryn Lyons's life has been peaceful if unextraordinary: a satisfying job teaching high school in the New England mill town of her childhood; a picture-perfect home by the ocean; a precocious, independent-minded fifteen-year-old daughter; and a happy marriage whose occasional dull passages she attributes to the unavoidable deadening of time. As Kathryn struggles with her grief, she descends into a maelstrom of publicity stirred up by the modern hunger for the details of tragedy. Even before the plane is located in waters off the Irish coast, the relentless scrutiny of her husband's life begins to bring a bizarre personal mystery into focus. Could there be any truth to the increasingly disturbing rumors that he had a secret life?","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=IG-q9FKkWGwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Open House","author":"Elizabeth Berg","description":"In this superb novel by the beloved author of Talk Before Sleep, The Pull of the Moon, and Until the Real Thing Comes Along, a woman re-creates her life after divorce by opening up her house and her heart. Samantha's husband has left her, and after a spree of overcharging at Tiffany's, she settles down to reconstruct a life for herself and her eleven-year-old son. Her eccentric mother tries to help by fixing her up with dates, but a more pressing problem is money. To meet her mortgage payments, Sam decides to take in boarders. The first is an older woman who offers sage advice and sorely needed comfort; the second, a maladjusted student, is not quite so helpful. A new friend, King, an untraditional man, suggests that Samantha get out, get going, get work. But her real work is this: In order to emerge from grief and the past, she has to learn how to make her own happiness. In order to really see people, she has to look within her heart. And in order to know who she is, she has to remember--and reclaim--the person she used to be, long before she became someone else in an effort to save her marriage. Open House is a love story about what can blossom between a man and a woman, and within a woman herself.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=3hHAHZW730cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Story of Edgar Sawtelle","author":"David Wroblewski","description":"Beautifully written and elegantly paced, The Story of Edgar Sawtelle is a coming-of-age novel about the power of the land and the past to shape our lives. It is a riveting tale of retribution, inhabited by empathic animals, prophetic dreams, second sight, and vengeful ghosts. Born mute, Edgar Sawtelle feels separate from the people around him but is able to establish profound bonds with the animals who share his home and his name: his family raises a fictional breed of exceptionally perceptive and affable dogs. Soon after his father's sudden death, Edgar is stunned to learn that his mother has already moved on as his uncle Claude quickly becomes part of their lives. Reeling from the sudden changes to his quiet existence, Edgar flees into the forests surrounding his Wisconsin home accompanied by three dogs. Soon he is caught in a struggle for survival — the only thing that will prepare him for his return home.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=IihAoooP_ToC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"House of Sand and Fog","author":"Andre Dubus III","description":"The National Book Award finalist, Oprah’s Book Club pick, #1 New York Times bestseller and basis for the Oscar-nominated motion picture A recent immigrant from the Middle East—a former colonel in the Iranian Air Force—yearns to restore his family’s dignity in California. A recovering alcoholic and addict down on her luck struggles to hold onto the one thing she has left?her home. And her lover, a married cop, is driven to extremes to win her love. Andre Dubus III’s unforgettable characters—people with ordinary flaws, looking for a small piece of ground to stand on—careen toward inevitable conflict. Their tragedy paints a shockingly true picture of the country we live in today.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=TOTBRDOkhpkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Ellen Foster","author":"Kaye Gibbons","description":"Having suffered abuse and misfortune for much of her life, a young child searches for a better life and finally gets a break in the home of a loving woman with several foster children.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=Emo9UNB9j1kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Tara Road","author":"Maeve Binchy","description":"NEW YORK TIMES BESTSELLER • “A tender novel of the pleasures and pitfalls of friendship Tara Road is an ultramodern love story for women, about women, between women that is sure to delight.”—Newsday New York Times bestselling author Maeve Binchy has captured the hearts of millions with her unforgettable novels. Binchy's graceful storytelling and wise compassion have earned her the devotion of fans worldwide--and made her one of the most beloved authors of our time. Now she dazzles us once again with a new novel filled with her signature warmth, humor, and tender insight. A provocative tale of family heartbreak, friendship, and revelation, Tara Road explores every woman's fantasy: escape, into another place, another life. \"What if . . .\" Binchy asks, and answers in her most astonishing novel to date. Praise for Tara Road “Her best work yet . . . Tara Road is like a total immersion in a colorful new world, where the last page comes too soon.”—Seattle Times “An irresistible tale.”—Elle “Engrossing.”—Wall Street Journal “Difficult to put down!”—Denver Post “One of Binchy's best.”—Kirkus Reviews","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=JZyNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Olive, Again","author":"Elizabeth Strout","description":"NEW YORK TIMES BESTSELLER • OPRAH’S BOOK CLUB PICK • Pulitzer Prize winner Elizabeth Strout continues the life of her beloved Olive Kitteridge, a character who has captured the imaginations of millions. “Strout managed to make me love this strange woman I’d never met, who I knew nothing about. What a terrific writer she is.”—Zadie Smith, The Guardian “Just as wonderful as the original . . . Olive, Again poignantly reminds us that empathy, a requirement for love, helps make life ‘not unhappy.’”—NPR NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY PEOPLE AND ONE OF THE BEST BOOKS OF THE YEAR BY Time • Vogue • NPR • The Washington Post • Chicago Tribune • Vanity Fair • Entertainment Weekly • BuzzFeed • Esquire • Real Simple • Good Housekeeping • The New York Public Library • The Guardian • Evening Standard • Kirkus Reviews • Publishers Weekly • BookPage Prickly, wry, resistant to change yet ruthlessly honest and deeply empathetic, Olive Kitteridge is “a compelling life force” (San Francisco Chronicle). The New Yorker has said that Elizabeth Strout “animates the ordinary with an astonishing force,” and she has never done so more clearly than in these pages, where the iconic Olive struggles to understand not only herself and her own life but the lives of those around her in the town of Crosby, Maine. Whether with a teenager coming to terms with the loss of her father, a young woman about to give birth during a hilariously inopportune moment, a nurse who confesses a secret high school crush, or a lawyer who struggles with an inheritance she does not want to accept, the unforgettable Olive will continue to startle us, to move us, and to inspire us—in Strout’s words—“to bear the burden of the mystery with as much grace as we can.” Praise for Olive, Again “Olive is a brilliant creation not only because of her eternal cantankerousness but because she’s as brutally candid with herself about her shortcomings as she is with others. Her honesty makes people strangely willing to confide in her, and the raw power of Ms. Strout’s writing comes from these unvarnished exchanges, in which characters reveal themselves in all of their sadness and badness and confusion. . . . The great, terrible mess of living is spilled out across the pages of this moving book. Ms. Strout may not have any answers for it, but she isn’t afraid of it either.”—The Wall Street Journal","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=GLpPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Ruby (Oprah's Book Club 2.0)","author":"Cynthia Bond","description":"A New York Times bestseller and Oprah Book Club 2.0 selection, the epic, unforgettable story of a man determined to protect the woman he loves from the town desperate to destroy her. This beautiful and devastating debut heralds the arrival of a major new voice in fiction. Ephram Jennings has never forgotten the beautiful girl with the long braids running through the piney woods of Liberty, their small East Texas town. Young Ruby Bell, “the kind of pretty it hurt to look at,” has suffered beyond imagining, so as soon as she can, she flees suffocating Liberty for the bright pull of 1950s New York. Ruby quickly winds her way into the ripe center of the city—the darkened piano bars and hidden alleyways of the Village—all the while hoping for a glimpse of the red hair and green eyes of her mother. When a telegram from her cousin forces her to return home, thirty-year-old Ruby finds herself reliving the devastating violence of her girlhood. With the terrifying realization that she might not be strong enough to fight her way back out again, Ruby struggles to survive her memories of the town’s dark past. Meanwhile, Ephram must choose between loyalty to the sister who raised him and the chance for a life with the woman he has loved since he was a boy. Full of life, exquisitely written, and suffused with the pastoral beauty of the rural South, Ruby is a transcendent novel of passion and courage. This wondrous page-turner rushes through the red dust and gossip of Main Street, to the pit fire where men swill bootleg outside Bloom’s Juke, to Celia Jennings’s kitchen, where a cake is being made, yolk by yolk, that Ephram will use to try to begin again with Ruby. Utterly transfixing, with unforgettable characters, riveting suspense, and breathtaking, luminous prose, Ruby offers an unflinching portrait of man’s dark acts and the promise of the redemptive power of love. Ruby was a finalist for the PEN America Robert Bingham Debut Novel Award, a Barnes & Noble Discover Great New Writers selection, and an Indie Next Pick.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=lPeKDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Invention of Wings","author":"Sue Monk Kidd","description":"From the celebrated author of The Secret Life of Bees and the forthcoming novel The Book of Longings, a novel about two unforgettable American women. Writing at the height of her narrative and imaginative gifts, Sue Monk Kidd presents a masterpiece of hope, daring, the quest for freedom, and the desire to have a voice in the world. Hetty “Handful” Grimke, an urban slave in early nineteenth century Charleston, yearns for life beyond the suffocating walls that enclose her within the wealthy Grimke household. The Grimke’s daughter, Sarah, has known from an early age she is meant to do something large in the world, but she is hemmed in by the limits imposed on women. Kidd’s sweeping novel is set in motion on Sarah’s eleventh birthday, when she is given ownership of ten year old Handful, who is to be her handmaid. We follow their remarkable journeys over the next thirty five years, as both strive for a life of their own, dramatically shaping each other’s destinies and forming a complex relationship marked by guilt, defiance, estrangement and the uneasy ways of love. As the stories build to a riveting climax, Handful will endure loss and sorrow, finding courage and a sense of self in the process. Sarah will experience crushed hopes, betrayal, unrequited love, and ostracism before leaving Charleston to find her place alongside her fearless younger sister, Angelina, as one of the early pioneers in the abolition and women’s rights movements. Inspired by the historical figure of Sarah Grimke, Kidd goes beyond the record to flesh out the rich interior lives of all of her characters, both real and invented, including Handful’s cunning mother, Charlotte, who courts danger in her search for something better. This exquisitely written novel is a triumph of storytelling that looks with unswerving eyes at a devastating wound in American history, through women whose struggles for liberation, empowerment, and expression will leave no reader unmoved.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=rVgBDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Icy Sparks","author":"Gwyn Hyman Rubio","description":"A New York Times Notable Book and the March 2001 selection of Oprah's Book Club® ! Icy Sparks is the sad, funny and transcendent tale of a young girl growing up in the mountains of Eastern Kentucky during the 1950’s. Gwyn Hyman Rubio’s beautifully written first novel revolves around Icy Sparks, an unforgettable heroine in the tradition of Scout in To Kill a Mockingbird or Will Treed in Cold Sassy Tree. At the age of ten, Icy, a bright, curious child orphaned as a baby but raised by adoring grandparents, begins to have strange experiences. Try as she might, her \"secrets\"—verbal croaks, groans, and physical spasms—keep afflicting her. As an adult, she will find out she has Tourette’s Syndrome, a rare neurological disorder, but for years her behavior is the source of mystery, confusion, and deep humiliation. Narrated by a grown up Icy, the book chronicles a difficult, but ultimately hilarious and heartwarming journey, from her first spasms to her self-acceptance as a young woman. Curious about life beyond the hills, talented, and energetic, Icy learns to cut through all barriers—physical, mental, and spiritual—in order to find community and acceptance. Along her journey, Icy faces the jeers of her classmates as well as the malevolence of her often-ignorant teachers—including Mrs. Stilton, one of the most evil fourth grade teachers ever created by a writer. Called willful by her teachers and \"Frog Child\" by her schoolmates, she is exiled from the schoolroom and sent to a children’s asylum where it is hoped that the roots of her mysterious behavior can be discovered. Here Icy learns about difference—her own and those who are even more scarred than she. Yet, it isn’t until Icy returns home that she really begins to flower, especially through her friendship with the eccentric and obese Miss Emily, who knows first-hand how it feels to be an outcast in this tightly knit Appalachian community. Under Miss Emily’s tutelage, Icy learns about life’s struggles and rewards, survives her first comical and heartbreaking misadventure with romance, discovers the healing power of her voice when she sings, and ultimately—takes her first steps back into the world. Gwyn Hyman Rubio’s Icy Sparks is a fresh, original, and completely redeeming novel about learning to overcome others’ ignorance and celebrate the differences that make each of us unique.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=RoxPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"We Were the Mulvaneys","author":"Joyce Carol Oates","description":"An Oprah Book Club® selection A New York Times Notable Book The Mulvaneys are blessed by all that makes life sweet. But something happens on Valentine’s Day, 1976—an incident that is hushed up in the town and never spoken of in the Mulvaney home—that rends the fabric of their family life...with tragic consequences. Years later, the youngest son attempts to piece together the fragments of the Mulvaneys’ former glory, seeking to uncover and understand the secret violation that brought about the family’s tragic downfall. Profoundly cathartic, this extraordinary novel unfolds as if Oates, in plumbing the darkness of the human spirit, has come upon a source of light at its core. Moving away from the dark tone of her more recent masterpieces, Joyce Carol Oates turns the tale of a family struggling to cope with its fall from grace into a deeply moving and unforgettable account of the vigor of hope and the power of love to prevail over suffering. “It’s the novel closest to my heart....I’m deeply moved that Oprah Winfrey has selected this novel for Oprah’s Book Club, a family novel presented to Oprah’s vast American family.”—Joyce Carol Oates","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=2Xj1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Here on Earth","author":"Alice Hoffman","description":"A seductive and mesmerizing story of obsessive love from the New York Times bestselling author of The Rules of Magic. After nineteen years in California, March Murray returns to the small Massachusetts town where she grew up. For all this time, March has been avoiding her own troubled history, but when she encounters Hollis—the boy she loved so desperately, the man who has never forgotten her—the past collides with the present as their reckless love is reignited. This dark romantic tale asks whether it is possible to survive a love that consumes you completely. The answers March Murray discovers are both heartbreaking and wise, as complex as they are devastating—for in heaven and in our dreams, love is simple and glorious. But it is something altogether different here on earth...","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=0bnG2l8_YiMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Heart Is a Lonely Hunter","author":"Carson McCullers","description":"A quiet, sensitive girl searches for beauty in a small, but damned Southern town.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=kARbAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Stones from the River","author":"Ursula Hegi","description":"From the acclaimed author of Floating in My Mother’s Palm and Children and Fire, a stunning story about ordinary people living in extraordinary times—“epic, daring, magnificent, the product of a defining and mesmerizing vision” (Los Angeles Times). Trudi Montag is a Zwerg—a dwarf—short, undesirable, different, the voice of anyone who has ever tried to fit in. Eventually she learns that being different is a secret that all humans share—from her mother who flees into madness, to her friend Georg whose parents pretend he’s a girl, to the Jews Trudi harbors in her cellar. Ursula Hegi brings us a timeless and unforgettable story in Trudi and a small town, weaving together a profound tapestry of emotional power, humanity, and truth.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=oMx9k6wH5aMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Paradise","author":"Toni Morrison","description":"The acclaimed Nobel Prize winner challenges our most fiercely held beliefs as she weaves folklore and history, memory and myth into an unforgettable meditation on race, religion, gender, and a far-off past that is ever present—in prose that soars with the rhythms, grandeur, and tragic arc of an epic poem. “They shoot the white girl first. With the rest they can take their time.” So begins Toni Morrison’s Paradise, which opens with a horrifying scene of mass violence and chronicles its genesis in an all-black small town in rural Oklahoma. Founded by the descendants of freed slaves and survivors in exodus from a hostile world, the patriarchal community of Ruby is built on righteousness, rigidly enforced moral law, and fear. But seventeen miles away, another group of exiles has gathered in a promised land of their own. And it is upon these women in flight from death and despair that nine male citizens of Ruby will lay their pain, their terror, and their murderous rage. “A fascinating story, wonderfully detailed. . . . The town is the stage for a profound and provocative debate.” —Los Angeles Times","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=kPaKDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Daughter of Fortune","author":"Isabel Allende","description":"From the New York Times bestselling author of The House of the Spirits, Isabelle Allende, comes a passionate tale of one young woman's quest to save her lover set against the chaos of the 1849 California Gold Rush. Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of every stripe have fallen prey to feverish dreams of wealth. Joaquín takes off for San Francisco to seek his fortune, and Eliza, pregnant with his child, decides to follow him. As Eliza embarks on her perilous journey north in the hold of a ship and arrives in the rough-and-tumble world of San Francisco, she must navigate a society dominated by greedy men. But Eliza soon catches on with the help of her natural spirit and a good friend, the Chinese doctor Tao Chi’en. What began as a search for love ends up as the conquest of personal freedom. A marvel of storytelling, Daughter of Fortune confirms once again Isabel Allende's extraordinary gift for fiction and her place as one of the world's leading writers.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=nOz3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"River, Cross My Heart","author":"Breena Clarke","description":"The acclaimed bestseller--a selection of Oprah's Book Club--that brings vividly to life the Georgetown neighborhood of Washington, DC, circa 1925, a community reeling from a young girl's tragic death. Five-year-old Clara Bynum is dead, drowned in the Potomac River in the shadow of a seemingly haunted rock outcropping known locally as the Three Sisters. River, Cross My Heart, which marks the debut of a wonderfully gifted new storyteller, weighs the effect of Clara's absence on the people she has left behind: her parents, Alice and Willie Bynum, torn between the old world of their rural North Carolina home and the new world of the city, to which they have moved in search of a better life for themselves and their children; the friends and relatives of the Bynum family in the Georgetown neighborhood they now call home; and, most especially, Clara's sister, ten-year-old Johnnie Mae, who must come to terms with the powerful and confused emotions stirred by her sister's death as she struggles to decide what kind of woman she will become. This highly accomplished first novel resonates with ideas, impassioned lyricism, and poignant historical detail as it captures an essential part of the African-American experience in our century.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=zQMvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"A Lesson Before Dying","author":"Ernest J. Gaines","description":"NATIONAL BOOK CRITICS CIRCLE AWARD WINNER • A deep and compassionate novel about a young man who returns to 1940s Cajun country to visit a Black youth on death row for a crime he didn't commit. Together they come to understand the heroism of resisting. \"An instant classic.\" —Chicago Tribune A “majestic, moving novel...an instant classic, a book that will be read, discussed and taught beyond the rest of our lives\" (Chicago Tribune), from the critically acclaimed author of A Gathering of Old Men and The Autobiography of Miss Jane Pittman. \"A Lesson Before Dying reconfirms Ernest J. Gaines's position as an important American writer.\" —Boston Globe \"Enormously moving.... Gaines unerringly evokes the place and time about which he writes.\" —Los Angeles Times “A quietly moving novel [that] takes us back to a place we've been before to impart a lesson for living.” —San Francisco Chronicle","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=cV-gTPZVm8wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Mother of Pearl","author":"Melinda Haynes","description":"Capturing all the rueful irony and racial ambiavalence of small-town Mississippi in the late 1950's, Melinda Haynes' celebrated novel is a wholly unforgettable exploration of family, identity, and redemption. \"Mother of Pearl\" revolves around twenty-eight-year-old Even Grade, a black man who grew up an orphan, and Valuable Korner, the fifteen-year-old white daughter of the town whore and an unknown father. Both are passionately determined to discover the precious things neither experienced as children: human connection, enduring commitment, and, above all, unconditional love. A startlingly accomplished mixture of beauty, mystery, and tradedy, \"Mother of Pearl\" marks the debut of an extraordinary literary talent.","categories":["African American men"],"coverImage":"No Image Available"},{"title":"Cane River","author":"Lalita Tademy","description":"A New York Times bestseller and Oprah's Book Club Pick-the unique and deeply moving saga of four generations of African-American women whose journey from slavery to freedom begins on a Creole plantation in Louisiana. Beginning with her great-great-great-great grandmother, a slave owned by a Creole family, Lalita Tademy chronicles four generations of strong, determined black women as they battle injustice to unite their family and forge success on their own terms. They are women whose lives begin in slavery, who weather the Civil War, and who grapple with contradictions of emancipation, Jim Crow, and the pre-Civil Rights South. As she peels back layers of racial and cultural attitudes, Tademy paints a remarkable picture of rural Louisiana and the resilient spirit of one unforgettable family. There is Elisabeth, who bears both a proud legacy and the yoke of bondage... her youngest daughter, Suzette, who is the first to discover the promise-and heartbreak-of freedom... Suzette's strong-willed daughter Philomene, who uses a determination born of tragedy to reunite her family and gain unheard-of economic independence... and Emily, Philomene's spirited daughter, who fights to secure her children's just due and preserve their dignity and future. Meticulously researched and beautifully written, Cane River presents a slice of American history never before seen in such piercing and personal detail.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=YF_-1nX8zl0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Reader","author":"Bernhard Schlink","description":"Hailed for its coiled eroticism and the moral claims it makes upon the reader, this mesmerizing novel is a story of love and secrets, horror and compassion, unfolding against the haunted landscape of postwar Germany. When he falls ill on his way home from school, fifteen-year-old Michael Berg is rescued by Hanna, a woman twice his age. In time she becomes his lover—then she inexplicably disappears. When Michael next sees her, he is a young law student, and she is on trial for a hideous crime. As he watches her refuse to defend her innocence, Michael gradually realizes that Hanna may be guarding a secret she considers more shameful than murder.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=2JYJicwT84cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"A Million Little Pieces","author":"James Frey, Trevor White","description":"James Frey comes to his senses on a plane, his face shattered and his body disintegrating from alcohol and drug abuse. In a desperate attempt to rescue him, his parents take him to a rehabilitation centre, where he must face the demons that have made him a violent, suicidal addict at the age of 23. He discovers a world peopled with despondent, damaged and determined characters. His friends, his family and most of all his beloved Lilly teach Frey how to love again. Frey's journey from the degradation of substance abuse to moral and spiritual redemption is as immaculately paced and structured as a novel. This bittersweet memoir is written with searing honesty. It is unflinching and devoid of self-pity, but filled with love and understanding for Frey's fellow-sufferers and his family. Uplifting, challenging and devastating in turns, this beautifully written book is poignant and compelling to the very end.'An extraordinary and deeply moving book that will make you think about family, friendship, love, religion, death and perhaps most of all, the human spirit' - Irish Sunday Independent","categories":[],"coverImage":"http://books.google.com/books/content?id=Pp6PPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"A Map of the World","author":"Jane Hamilton","description":"Pen/Hemingway Award-winning novelist Jane Hamilton follows up her first success, The Book Of Ruth, with this spectacularly haunting drama about a rural American family and a disastrous event that forever changes their lives. The Goodwins, Howard, Alice, and their little girls, Emma and Claire, live on a dairy farm in Wisconsin. Although suspiciously regarded by their neighbors as \"that hippie couple\" because of their well-educated, urban background, Howard and Alice believe they have found a source of emotional strength in the farm, he tending the barn while Alice works as a nurse in the local elementary school. But their peaceful life is shattered one day when a neighbor's two-year-old daughter drowns in the Goodwins' pond while under Alice's care. Tormented by the accident, Alice descends even further into darkness when she is accused of sexually abusing a student at the elementary school. Soon, Alice is arrested, incarcerated, and as good as convicted in the eyes of a suspicious community. As a child, Alice designed her own map of the world to find her bearings. Now, as an adult, she must find her way again, through a maze of lies, doubt and ill will. A vivid human drama of guilt and betrayal, A Map of the World chronicles the intricate geographies of the human heart and all its mysterious, uncharted terrain. The result is a piercing drama about family bonds and a disappearing rural American life.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=FLMf5wDLdAsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Jewel","author":"Bret Lott","description":"In the backwoods of Mississippi, a land of honeysuckle and grapevine, Jewel and her husband, Leston, are truly blessed; they have five fine children. When Brenda Kay is born in 1943, Jewel gives thanks for a healthy baby, last-born and most welcome. Jewel is the story of how quickly a life can change; how, like lightning, an unforeseen event can set us on a course without reason or compass. In this story of a woman's devotion to the child who is both her burden and God's singular way of smiling on her, Bret Lott has created a mother-daughter relationship of matchless intensity and beauty, and one of the finest, most indomitable heroines in contemporary American fiction.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=0RlW6FIdvMYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Behold the Dreamers","author":"Imbolo Mbue","description":"A compulsively readable debut novel about marriage, immigration, class, race, and the trapdoors in the American Dream—the unforgettable story of a young Cameroonian couple making a new life in New York just as the Great Recession upends the economy New York Times Bestseller • Winner of the PEN/Faulkner Award • Longlisted for the PEN/Open Book Award • An ALA Notable Book NAMED ONE OF THE BEST BOOKS OF THE YEAR BY NPR • The New York Times Book Review • San Francisco Chronicle • The Guardian • St. Louis Post-Dispatch • Chicago Public Library • BookPage • Refinery29 • Kirkus Reviews Jende Jonga, a Cameroonian immigrant living in Harlem, has come to the United States to provide a better life for himself, his wife, Neni, and their six-year-old son. In the fall of 2007, Jende can hardly believe his luck when he lands a job as a chauffeur for Clark Edwards, a senior executive at Lehman Brothers. Clark demands punctuality, discretion, and loyalty—and Jende is eager to please. Clark’s wife, Cindy, even offers Neni temporary work at the Edwardses’ summer home in the Hamptons. With these opportunities, Jende and Neni can at last gain a foothold in America and imagine a brighter future. However, the world of great power and privilege conceals troubling secrets, and soon Jende and Neni notice cracks in their employers’ façades. When the financial world is rocked by the collapse of Lehman Brothers, the Jongas are desperate to keep Jende’s job—even as their marriage threatens to fall apart. As all four lives are dramatically upended, Jende and Neni are forced to make an impossible choice. Praise for Behold the Dreamers “A debut novel by a young woman from Cameroon that illuminates the immigrant experience in America with the tenderhearted wisdom so lacking in our political discourse . . . Mbue is a bright and captivating storyteller.”—The Washington Post “A capacious, big-hearted novel.”—The New York Times Book Review “Behold the Dreamers’ heart . . . belongs to the struggles and small triumphs of the Jongas, which Mbue traces in clean, quick-moving paragraphs.”—Entertainment Weekly “Mbue’s writing is warm and captivating.”—People (book of the week) “[Mbue’s] book isn’t the first work of fiction to grapple with the global financial crisis of 2007–2008, but it’s surely one of the best. . . . It’s a novel that depicts a country both blessed and doomed, on top of the world, but always at risk of losing its balance. It is, in other words, quintessentially American.”—NPR “This story is one that needs to be told.”—Bust “Behold the Dreamers challenges us all to consider what it takes to make us genuinely content, and how long is too long to live with our dreams deferred.”—O: The Oprah Magazine “[A] beautiful, empathetic novel.”—The Boston Globe “A witty, compassionate, swiftly paced novel that takes on race, immigration, family and the dangers of capitalist excess.”—St. Louis Post-Dispatch “Mbue [is] a deft, often lyrical observer. . . . [Her] meticulous storytelling announces a writer in command of her gifts.”—Minneapolis Star Tribune","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=nEcsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Pillars of the Earth","author":"Ken Follett","description":"#1 New York Times Bestseller Oprah's Book Club Selection The “extraordinary . . . monumental masterpiece” (Booklist) that changed the course of Ken Follett’s already phenomenal career—and begins where its prequel, The Evening and the Morning, ended. “Follett risks all and comes out a clear winner,” extolled Publishers Weekly on the release of The Pillars of the Earth. A departure for the bestselling thriller writer, the historical epic stunned readers and critics alike with its ambitious scope and gripping humanity. Today, it stands as a testament to Follett’s unassailable command of the written word and to his universal appeal. The Pillars of the Earth tells the story of Philip, prior of Kingsbridge, a devout and resourceful monk driven to build the greatest Gothic cathedral the world has known . . . of Tom, the mason who becomes his architect—a man divided in his soul . . . of the beautiful, elusive Lady Aliena, haunted by a secret shame . . . and of a struggle between good and evil that will turn church against state and brother against brother. A spellbinding epic tale of ambition, anarchy, and absolute power set against the sprawling medieval canvas of twelfth-century England, this is Ken Follett’s historical masterpiece.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=QYYQDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Tender Is the Night","author":"F. Scott Fitzgerald","description":"Francis Scott Key Fitzgerald (1896–1940) was an American author of novels and short stories, whose works are the paradigmatic writings of the Jazz Age, a term he coined. He is widely regarded as one of the greatest American writers of the 20th century. Tender Is the Night is a novel by American writer F. Scott Fitzgerald. It was his fourth and final completed novel, and was first published in Scribner's Magazine between January–April, 1934 in four issues. The title is taken from the poem \"Ode to a Nightingale\" by John Keats. In 1932, Fitzgerald's wife Zelda Sayre Fitzgerald was hospitalized for schizophrenia in Baltimore, Maryland. The author rented the \"la Paix\" estate in the suburb of Towson to work on this book, the story of the rise and fall of Dick Diver, a promising young psychoanalyst and his wife, Nicole, who is also one of his patients. It was Fitzgerald's first novel in nine years, and the last that he would complete. While working on the book he several times ran out of cash and had to borrow from his editor and agent, and write short stories for commercial magazines. The early 1930s, when Fitzgerald was conceiving and working on the book, were certainly the darkest years of his life, and accordingly, the novel has its bleak elements. In the novel, Dick is eventually ruined--professionally, emotionally, and spiritually--by his union with Nicole. Of all his novels, Tender Is the Night is arguably the one closest to his heart. As he himself wrote, \"Gatsby was a tour de force, but this is a confession of faith.\"","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=6CO0AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Giving Tree","author":"Shel Silverstein","description":"As The Giving Tree turns fifty, this timeless classic is available for the first time ever in ebook format. This digital edition allows young readers and lifelong fans to continue the legacy and love of a classic that will now reach an even wider audience. \"Once there was a tree...and she loved a little boy.\" So begins a story of unforgettable perception, beautifully written and illustrated by the gifted and versatile Shel Silverstein. This moving parable for all ages offers a touching interpretation of the gift of giving and a serene acceptance of another's capacity to love in return. Every day the boy would come to the tree to eat her apples, swing from her branches, or slide down her trunk...and the tree was happy. But as the boy grew older he began to want more from the tree, and the tree gave and gave and gave. This is a tender story, touched with sadness, aglow with consolation. Shel Silverstein's incomparable career as a bestselling children's book author and illustrator began with Lafcadio, the Lion Who Shot Back. He is also the creator of picture books including A Giraffe and a Half, Who Wants a Cheap Rhinoceros?, The Missing Piece, The Missing Piece Meets the Big O, and the perennial favorite The Giving Tree, and of classic poetry collections such as Where the Sidewalk Ends, A Light in the Attic, Falling Up, Every Thing On It, Don't Bump the Glump!, and Runny Babbit. And don't miss the other Shel Silverstein ebooks, Where the Sidewalk Ends and A Light in the Attic!","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=1IleAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Aeneid of Virgil","author":"Virgil, Allen Mandelbaum","description":"From the cover. This deluxe edition of Virgil's epic poem, recounting the wanderings of Aeneas and his companions after the fall of Troy, contains an introduction, glossary, and bibliographic notes by Allen Mandelbaum, together with fourteen powerful illustrations created for this volume by Barry Moser.","categories":["Aeneas (Legendary character)"],"coverImage":"http://books.google.com/books/content?id=gVFmgwGFgbIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Aeneid of Virgil","author":"Virgil","description":"The Aeneid of Virgil (19 BC) is an epic poem by Roman poet Virgil. Virgil’s legendary epic is the story of the hero Aeneas, a castaway from Troy whose adventures across the Mediterranean led him to Italy, where he discovered what would later become the city of Rome. Presented here in an accessible prose translation, The Aeneid of Virgil is a treasure of classical literature and a story of romance, war, and adventure to rival the best of Homer. Fleeing the destruction of Troy by Greek forces, Aeneas brings his son Ascanius and father Anchises on a voyage across the sea. Landing in Carthage, Aeneas, his family, and his crew are rescued by Dido, Queen of Tyre. There, Aeneas, despite mourning the loss of his beloved wife Creusa, falls in love with Dido, who offers him refuge and her devoted love. Knowing that he is destined to found a city in Italy, however, Aeneas abandons the queen, leading her to commit suicide. Now determined to fulfill his destiny at any cost, Aeneas sails to Sicily, journeys to the underworld, and eventually arrives in the region of Latium, where he is swept up in conflict with Turnus, the Rutulian king. Flawed and feared, Aeneas exemplifies the imperfect hero compelled by fate and the gods, yet ultimately driven through a will to survive and provide for his fledgling people. Faithfully but concisely translated into accessible English prose, The Aeneid of Virgil is best read aloud with friends and family, and iconic masterpiece of ancient Rome still relevant for our modern world. With a beautifully designed cover and professionally typeset manuscript, this edition of The Aeneid of Virgil is a classic work of Roman literature reimagined for modern readers.","categories":["Poetry"],"coverImage":"http://books.google.com/books/content?id=SW8vEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Orwell's Revenge","author":"Peter Huber","description":"In alternating chapters of fiction and nonfiction, Huber turns the computer against Orwell's words, reimagining Orwell's 1984 from the computer's point of view, interpolating Huger's own explanations and arguments.","categories":["Computers"],"coverImage":"http://books.google.com/books/content?id=zAb5CQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Life of Pi","author":"Yann Martel","description":"Winner of the 2022 Olivier Award for Best New Play \"Life of Pi will make you believe in the power of theatre\" (Times). After a cargo ship sinks in the middle of the vast Pacific Ocean, there are five survivors stranded on a lifeboat - a hyena, a zebra, an orangutan, a Royal Bengal tiger, and a sixteen year-old boy named Pi. Time is against them, nature is harsh, who will survive? Based on one of the most extraordinary and best-loved works of fiction - winner of the Man Booker Prize, selling over fifteen million copies worldwide - and featuring breath-taking puppetry and state-of-the-art visuals, Life of Pi is a universally acclaimed, smash hit adaptation of an epic journey of endurance and hope. Adapted by acclaimed playwright Lolita Chakrabarti, this edition was published to coincide with the West End premiere in November 2021.","categories":["Performing Arts"],"coverImage":"http://books.google.com/books/content?id=c3JeEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Where the Wild Things Are - Literature Kit Gr. 1-2","author":"Marie-Helen Goyetche","description":"Escape to a land of Wild Things to discover that being with people who love you best is more important than misbehaving. Get into Max's mindset and decide whether he regrets being a Wild Thing. Match the beginning of a word with its ending. Transform words from the story in their past tense to their present tense. Complete statements about the story by adding the word 'before' or 'after' to make them true. Students describe a time when they made 'mischief' just like Max, and what the consequences were. Create a Wild Things menu complete with meal, vegetables, drink, and dessert. Students compare themselves with Max to see what things they have in common in a Venn Diagram. Aligned to your State Standards and written to Bloom's Taxonomy, additional crossword, word search, comprehension quiz and answer key are also included. About the Novel: This story is based on a mischievous boy named Max, who dresses up in a wolf suit and does things he shouldn't. His mom gets upset and calls him a Wild Thing! Max retaliates by screaming back to his mom, \"I'll eat you up!\" From within his imagination, Max's room goes from forest to ocean with Max inside the little boat where he comes up to the land of Wild Things. Max becomes lonely and he smells good things to eat. Wanting to be with someone who loved him best of all, he leaves the land of Wild Things. He comes back to his own room where he finds his supper, still hot, waiting for him.","categories":["Education"],"coverImage":"http://books.google.com/books/content?id=sxLdBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Commonwealth","author":"Ann Patchett","description":"“Exquisite... Commonwealth is impossible to put down.” — New York Times #1 New York Times Bestseller | NBCC Award Finalist | New York Times Best Book of the Year | USA Today Best Book | TIME Magazine Top 10 Selection | Oprah Favorite Book | New York Magazine Best Book of The Year The acclaimed, bestselling author—winner of the PEN/Faulkner Award and the Orange Prize—tells the enthralling story of how an unexpected romantic encounter irrevocably changes two families’ lives. One Sunday afternoon in Southern California, Bert Cousins shows up at Franny Keating’s christening party uninvited. Before evening falls, he has kissed Franny’s mother, Beverly—thus setting in motion the dissolution of their marriages and the joining of two families. Spanning five decades, Commonwealth explores how this chance encounter reverberates through the lives of the four parents and six children involved. Spending summers together in Virginia, the Keating and Cousins children forge a lasting bond that is based on a shared disillusionment with their parents and the strange and genuine affection that grows up between them. When, in her twenties, Franny begins an affair with the legendary author Leon Posen and tells him about her family, the story of her siblings is no longer hers to control. Their childhood becomes the basis for his wildly successful book, ultimately forcing them to come to terms with their losses, their guilt, and the deeply loyal connection they feel for one another. Told with equal measures of humor and heartbreak, Commonwealth is a meditation on inspiration, interpretation, and the ownership of stories. It is a brilliant and tender tale of the far-reaching ties of love and responsibility that bind us together.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=OhswCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Alexander and the Terrible, Horrible, No Good, Very Bad Day","author":"Judith Viorst","description":"Recounts the events of a day when everything goes wrong for Alexander. Suggested level: junior, primary.","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=JN6IRLJx0RcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"White Teeth","author":"Zadie Smith","description":"NATIONAL BESTSELLER • The blockbuster debut novel from \"a preternaturally gifted\" writer (The New York Times) and author of On Beauty and Swing Time—set against London's racial and cultural tapestry, reveling in the ecstatic hodgepodge of modern life, flirting with disaster, and embracing the comedy of daily existence. Zadie Smith’s dazzling debut caught critics grasping for comparisons and deciding on everyone from Charles Dickens to Salman Rushdie to John Irving and Martin Amis. But the truth is that Zadie Smith’s voice is remarkably, fluently, and altogether wonderfully her own. At the center of this invigorating novel are two unlikely friends, Archie Jones and Samad Iqbal. Hapless veterans of World War II, Archie and Samad and their families become agents of England’s irrevocable transformation. A second marriage to Clara Bowden, a beautiful, albeit tooth-challenged, Jamaican half his age, quite literally gives Archie a second lease on life, and produces Irie, a knowing child whose personality doesn’t quite match her name (Jamaican for “no problem”). Samad’s late-in-life arranged marriage (he had to wait for his bride to be born), produces twin sons whose separate paths confound Iqbal’s every effort to direct them, and a renewed, if selective, submission to his Islamic faith. “[White Teeth] is, like the London it portrays, a restless hybrid of voices, tones, and textures…with a raucous energy and confidence.” —The New York Times Book Review","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=zZFlmid0HOYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"TTYL","author":"Melissa J. Morgan","description":"Having left summer camp to return home, the girls from bunk 3C use a blog to keep one another informed of their struggles adjusting to 6th grade at their respective schools and to new situations at home.","categories":["Blogs"],"coverImage":"http://books.google.com/books/content?id=iNhI60b9gmoC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Story of Babar","author":"Jean De Brunhoff","description":"The classic story of literature’s most beloved elephant. After his mother is killed by a hunter, Babar avoids capture by escaping to the city, where he is befriended by the kindly Old Lady. Later, with cousins Celeste and Arthur, he returns to the great forest to be crowned King of the Elephants. With the original illustrations from Jean de Brunhoff's 1931 classic, this first Babar story has enchanted generations.","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=kdDfK4Xl1YAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Cat in the Hat","author":"Dr. Seuss","description":"Have a ball with Dr. Seuss and the Cat in the Hat in this classic picture book...but don't forget to clean up your mess! A dreary day turns into a wild romp when this beloved story introduces readers to the Cat in the Hat and his troublemaking friends, Thing 1 and Thing 2. A favorite among kids, parents and teachers, this story uses simple words and basic ryhme to encourage and delight beginning readers. Then he said \"That is that.\" And then he was gone With a tip of his hat. Originally created by Dr. Seuss himself, Beginner Books are fun, funny, and easy to read. These unjacketed hardcover early readers encourage children to read all on their own, using simple words and illustrations. Smaller than the classic large format Seuss picture books like The Lorax and Oh, The Places You’ll Go!, these portable packages are perfect for practicing readers ages 3-7, and lucky parents too!","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=ia7xAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Olivia","author":"Ian Falconer","description":"The heart-warming tale of a sweet little pig with a whole heap of energy.","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=7bh6lgoT_dEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Brown Bear, Brown Bear, What Do You See?","author":"Bill Martin, Jr.","description":"A pictorial representation of a question and answer game played by a teacher and her group.","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=oy-YsFqZEtMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"A Gentleman in Moscow","author":"Amor Towles","description":"The mega-bestseller with more than 2 million readers, soon to be a Showtime/Paramount series starring Ewan McGregor as Count Alexander Rostov From the #1 New York Times-bestselling author of The Lincoln Highway and Rules of Civility, a beautifully transporting novel about a man who is ordered to spend the rest of his life inside a luxury hotel In 1922, Count Alexander Rostov is deemed an unrepentant aristocrat by a Bolshevik tribunal, and is sentenced to house arrest in the Metropol, a grand hotel across the street from the Kremlin. Rostov, an indomitable man of erudition and wit, has never worked a day in his life, and must now live in an attic room while some of the most tumultuous decades in Russian history are unfolding outside the hotel’s doors. Unexpectedly, his reduced circumstances provide him entry into a much larger world of emotional discovery. Brimming with humor, a glittering cast of characters, and one beautifully rendered scene after another, this singular novel casts a spell as it relates the count’s endeavor to gain a deeper understanding of what it means to be a man of purpose.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=-9CLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Moby-Dick","author":"Herman Melville","description":"Herman Melville’s masterpiece, one of the greatest works of imagination in literary history. Nominated as one of America’s best-loved novels by PBS’s The Great American Read Over a century and a half after its publication, Moby-Dick still stands as an indisputable literary classic. It is the story of an eerily compelling madman pursuing an unholy war against a creature as vast and dangerous and unknowable as the sea itself. But more than just a novel of adventure, more than an encyclopedia of whaling lore and legend, Moby-Dick is a haunting, mesmerizing, and important social commentary populated with several of the most unforgettable and enduring characters in literature. Never losing its cultural prescence, Melville’s nautical epic has inspired many films over the years, including the film adaptation of Nathanael Philbrick’s In the Heart of the Sea, starring Chris Hemsworth, Cillian Murphy, Ben Wishaw, and Brendan Gleeson, and directed by Ron Howard. Written with wonderfully redemptive humor, Moby-Dick is a profound and timeless inquiry into character, faith, and the nature of perception. This Penguin Classics edition, featuring an introduction by Andrew Delbanco and notes by Tom Quirk, prints the Northwestern-Newberry edition of Melville's text, approved by the Center for Scholarly Editions and the Center for Editions of American Authors of the MLA. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=VFAparWKC1EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Life of Pi","author":"Yann Martel","description":"Winner of the 2022 Olivier Award for Best New Play \"Life of Pi will make you believe in the power of theatre\" (Times). After a cargo ship sinks in the middle of the vast Pacific Ocean, there are five survivors stranded on a lifeboat - a hyena, a zebra, an orangutan, a Royal Bengal tiger, and a sixteen year-old boy named Pi. Time is against them, nature is harsh, who will survive? Based on one of the most extraordinary and best-loved works of fiction - winner of the Man Booker Prize, selling over fifteen million copies worldwide - and featuring breath-taking puppetry and state-of-the-art visuals, Life of Pi is a universally acclaimed, smash hit adaptation of an epic journey of endurance and hope. Adapted by acclaimed playwright Lolita Chakrabarti, this edition was published to coincide with the West End premiere in November 2021.","categories":["Performing Arts"],"coverImage":"http://books.google.com/books/content?id=c3JeEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Americanah","author":"Chimamanda Ngozi Adichie","description":"WINNER 2013 – National Book Critics Circle Award for Fiction FINALIST 2014 – Baileys Women’s Prize for Fiction FINALIST 2014 – Andrew Carnegie Medal for Fiction LONGLISTED 2015 – International IMPAC Dublin Literary Award A searing new novel, at once sweeping and intimate, by the award-winning author of Half of a Yellow Sun: a story of love and race centered around a man and woman from Nigeria who seemed destined to be together--until the choices they are forced to make tear them apart. Ifemelu--beautiful, self-assured--left Nigeria 15 years ago, and now studies in Princeton as a Graduate Fellow. She seems to have fulfilled every immigrant's dream: Ivy League education; success as a writer of a wildly popular political blog; money for the things she needs. But what came before is more like a nightmare: wrenching departure from family; humiliating jobs under a false name. She feels for the first time the weight of something she didn't think about back home: race. Obinze--handsome and kind-hearted--was Ifemelu's teenage love; he'd hoped to join her in America, but post 9/11 America wouldn't let him in. Obinze's journey leads him to back alleys of illegal employment in London; to a fake marriage for the sake of a work card, and finally, to a set of handcuffs as he is exposed and deported. Years later, when they reunite in Nigeria, neither is the same person who left home. Obinze is the kind of successful \"Big Man\" he'd scorned in his youth, and Ifemelu has become an \"Americanah\"--a different version of her former self, one with a new accent and attitude. As they revisit their shared passion--for their homeland and for each other--they must face the largest challenges of their lives. Spanning three continents, entering the lives of a richly drawn cast of characters across numerous divides, Americanah is a riveting story of love and expectation set in today's globalized world.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=siSlP9JOj2YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Lowland","author":"Jhumpa Lahiri","description":"SHORTLISTED FOR THE MAN BOOKER PRIZE 2013. From Subhash's earliest memories, at every point, his brother was there. In the suburban streets of Calcutta where they wandered before dusk and in the hyacinth-strewn ponds where they played for hours on end, Udayan was always in his older brother's sight.So close in age, they were inseparable in childhood and yet, as the years pass - as U.S tanks roll into Vietnam and riots sweep across India - their brotherly bond can do nothing to forestall the tragedy that will upend their lives. Udayan - charismatic and impulsive - finds himself drawn to the Naxalite movement, a rebellion waged to eradicate inequity and poverty. He will give everything, risk all, for what he believes, and in doing so will transform the futures of those dearest to him: his newly married, pregnant wife, his brother and their parents. For all of them, the repercussions of his actions will reverberate across continents and seep through the generations that follow.Epic in its canvas and intimate in its portrayal of lives undone and forged anew, The Lowland is a deeply felt novel of family ties that entangle and fray in ways unforeseen and unrevealed, of ties that ineluctably define who we are. With all the hallmarks of Jhumpa Lahiri's achingly poignant, exquisitely empathetic story-telling, this is her most devastating work of fiction to date.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=ZfJdAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Girl, Woman, Other","author":"Bernardine Evaristo","description":"NATIONAL BESTSELLER WINNER OF THE BOOKER PRIZE “A must-read about modern Britain and womanhood . . . An impressive, fierce novel about the lives of black British families, their struggles, pains, laughter, longings and loves . . . Her style is passionate, razor-sharp, brimming with energy and humor. There is never a single moment of dullness in this book and the pace does not allow you to turn away from its momentum.” —Booker Prize Judges Bernardine Evaristo is the winner of the 2019 Booker Prize and the first black woman to receive this highest literary honor in the English language. Girl, Woman, Other is a magnificent portrayal of the intersections of identity and a moving and hopeful story of an interconnected group of Black British women that paints a vivid portrait of the state of contemporary Britain and looks back to the legacy of Britain’s colonial history in Africa and the Caribbean. The twelve central characters of this multi-voiced novel lead vastly different lives: Amma is a newly acclaimed playwright whose work often explores her Black lesbian identity; her old friend Shirley is a teacher, jaded after decades of work in London’s funding-deprived schools; Carole, one of Shirley’s former students, is a successful investment banker; Carole’s mother Bummi works as a cleaner and worries about her daughter’s lack of rootedness despite her obvious achievements. From a nonbinary social media influencer to a 93-year-old woman living on a farm in Northern England, these unforgettable characters also intersect in shared aspects of their identities, from age to race to sexuality to class. Sparklingly witty and filled with emotion, centering voices we often see othered, and written in an innovative fast-moving form that borrows technique from poetry, Girl, Woman, Other is a polyphonic and richly textured social novel that shows a side of Britain we rarely see, one that reminds us of all that connects us to our neighbors, even in times when we are encouraged to be split apart.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=U32pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Lost Children Archive","author":"Valeria Luiselli","description":"NEW YORK TIMES 10 BEST BOOKS OF THE YEAR • “An epic road trip [that also] captures the unruly intimacies of marriage and parenthood ... This is a novel that daylights our common humanity, and challenges us to reconcile our differences.” —The Washington Post In Valeria Luiselli’s fiercely imaginative follow-up to the American Book Award-winning Tell Me How It Ends, an artist couple set out with their two children on a road trip from New York to Arizona in the heat of summer. As the family travels west, the bonds between them begin to fray: a fracture is growing between the parents, one the children can almost feel beneath their feet. Through ephemera such as songs, maps and a Polaroid camera, the children try to make sense of both their family’s crisis and the larger one engulfing the news: the stories of thousands of kids trying to cross the southwestern border into the United States but getting detained—or lost in the desert along the way. A breath-taking feat of literary virtuosity, Lost Children Archive is timely, compassionate, subtly hilarious, and formally inventive—a powerful, urgent story about what it is to be human in an inhuman world.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=bzHJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"ASYMMETRY.","author":"LISA. HALLIDAY","description":"No Description Available","categories":[],"coverImage":"No Image Available"},{"title":"Gilead","author":"Marilynne Robinson","description":"In 1956, toward the end of his life, Reverend John Ames begins a letter to his young son, sharing the story of his life and explaining how his faith influenced his choices and actions.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=ERVAPnnF3gcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Men Without Women","author":"Haruki Murakami","description":"A dazzling new collection of short stories--the first major new work of fiction from the beloved, internationally acclaimed, Haruki Murakami since his #1 best-selling Colorless Tsukuru Tazaki and His Years of Pilgrimage. Across seven tales, Haruki Murakami brings his powers of observation to bear on the lives of men who, in their own ways, find themselves alone. Here are vanishing cats and smoky bars, lonely hearts and mysterious women, baseball and the Beatles, woven together to tell stories that speak to us all. Marked by the same wry humor that has defined his entire body of work, in this collection Murakami has crafted another contemporary classic.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=8xdBvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Nickel Boys (Winner 2020 Pulitzer Prize for Fiction)","author":"Colson Whitehead","description":"NATIONAL BESTSELLER • In this Pulitzer Prize-winning follow-up to The Underground Railroad, Colson Whitehead brilliantly dramatizes another strand of American history through the story of two boys unjustly sentenced to a hellish reform school in Jim Crow-era Florida. When Elwood Curtis, a black boy growing up in 1960s Tallahassee, is unfairly sentenced to a juvenile reformatory called the Nickel Academy, he finds himself trapped in a grotesque chamber of horrors. Elwood’s only salvation is his friendship with fellow “delinquent” Turner, which deepens despite Turner’s conviction that Elwood is hopelessly naive, that the world is crooked, and that the only way to survive is to scheme and avoid trouble. As life at the Academy becomes ever more perilous, the tension between Elwood’s ideals and Turner’s skepticism leads to a decision whose repercussions will echo down the decades. Based on the real story of a reform school that operated for 111 years and warped the lives of thousands of children, The Nickel Boys is a devastating, driven narrative that showcases a great American novelist writing at the height of his powers and “should further cement Whitehead as one of his generation's best\" (Entertainment Weekly). Look for Colson Whitehead’s bestselling new novel, Harlem Shuffle!","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=JkGNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Ministry for the Future","author":"Kim Stanley Robinson","description":"ONE OF BARACK OBAMA’S FAVORITE BOOKS OF THE YEAR “The best science-fiction nonfiction novel I’ve ever read.” —Jonathan Lethem \"If I could get policymakers, and citizens, everywhere to read just one book this year, it would be Kim Stanley Robinson’s The Ministry for the Future.\" —Ezra Klein (Vox) The Ministry for the Future is a masterpiece of the imagination, using fictional eyewitness accounts to tell the story of how climate change will affect us all. Its setting is not a desolate, postapocalyptic world, but a future that is almost upon us. Chosen by Barack Obama as one of his favorite books of the year, this extraordinary novel from visionary science fiction writer Kim Stanley Robinson will change the way you think about the climate crisis. \"One hopes that this book is read widely—that Robinson’s audience, already large, grows by an order of magnitude. Because the point of his books is to fire the imagination.\"―New York Review of Books \"If there’s any book that hit me hard this year, it was Kim Stanley Robinson’s The Ministry for the Future, a sweeping epic about climate change and humanity’s efforts to try and turn the tide before it’s too late.\" ―Polygon (Best of the Year) \"Masterly.\" —New Yorker \"[The Ministry for the Future] struck like a mallet hitting a gong, reverberating through the year ... it’s terrifying, unrelenting, but ultimately hopeful. Robinson is the SF writer of my lifetime, and this stands as some of his best work. It’s my book of the year.\" —Locus \"Science-fiction visionary Kim Stanley Robinson makes the case for quantitative easing our way out of planetary doom.\" ―Bloomberg Green","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=K_DNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Four Great Tragedies","author":"William Shakespeare","description":"The plays here--Hamlet, Othello, King Lear, and Macbeth--are considered to be the four central works of Shakespearean tragedy and must be included in any list of the world's finest tragic literature. Another volume of the finest, most comprehensive Shakespeare series available.","categories":["Tragedy"],"coverImage":"http://books.google.com/books/content?id=6XEgHLEkyOgC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Warlight","author":"Michael Ondaatje","description":"NATIONAL BESTSELLER • BOOKER PRIZE FINALIST • From the internationally acclaimed, Booker Prize-winning author of The English Patient: “an elegiac thriller [with] the immediate allure of a dark fairy tale” (The Washington Post) set in the decade after World War II that tells the dramatic story of two teenagers and an eccentric group of characters. In a narrative as beguiling and mysterious as memory itself—shadowed and luminous at once—we read the story of fourteen-year-old Nathaniel, and his older sister, Rachel. In 1945, just after World War II, they stay behind in London when their parents move to Singapore, leaving them in the care of a mysterious figure named The Moth. They suspect he might be a criminal, and they grow both more convinced and less concerned as they come to know his eccentric crew of friends: men and women joined by a shared history of unspecified service during the war, all of whom seem, in some way, determined now to protect, and educate (in rather unusual ways) Rachel and Nathaniel. But are they really what and who they claim to be? And what does it mean when the siblings' mother returns after months of silence without their father, explaining nothing, excusing nothing? A dozen years later, Nathaniel begins to uncover all that he didn't know and understand in that time, and it is this journey—through facts, recollection, and imagination—that he narrates in this masterwork from one of the great writers of our time.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=k8cyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"We Live in Water","author":"Jess Walter","description":"ONE OF PRESIDENT BARACK OBAMA’S FAVORITE BOOKS OF 2019 From the New York Times bestselling author of Beautiful Ruins, the first collection of short fiction from Jess Walter—a suite of diverse and searching stories about personal struggle and diminished dreams, all of them marked by the wry wit, keen eye, and generosity of spirit that has made him a bookseller and reader favorite These twelve stories—published over the last five years in Harper’s, The Best American Short Stories, McSweeney’s, Playboy, and other publications—veer from comic tales of love to social satire to suspenseful crime fiction, from hip Portland to once-hip Seattle to never-hip Spokane, from a condemned casino in Las Vegas to a bottomless lake in the dark woods of Idaho. This is a world of lost fathers and redemptive conmen, of meth tweakers on desperate odysseys and men committing suicide by fishing. We Live in Water is a darkly comic, heartfelt collection of stories from a “ridiculously talented writer” (New York Times), “one of the freshest voices in American literature” (Dallas Morning News).","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=sSrS8zPmHnEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Five-Carat Soul","author":"James McBride","description":"One of The New York Times' 100 Notable Books of 2017 “A pinball machine zinging with sharp dialogue, breathtaking plot twists and naughty humor... McBride at his brave and joyous best.” —New York Times Book Review From the New York Times bestselling author of The Good Lord Bird, winner of the 2013 National Book Award for Fiction, Deacon King Kong, and Kill 'Em and Leave, a James Brown biography. The stories in Five-Carat Soul—none of them ever published before—spring from the place where identity, humanity, and history converge. They’re funny and poignant, insightful and unpredictable, imaginative and authentic—all told with McBride’s unrivaled storytelling skill and meticulous eye for character and detail. McBride explores the ways we learn from the world and the people around us. An antiques dealer discovers that a legendary toy commissioned by Civil War General Robert E. Lee now sits in the home of a black minister in Queens. Five strangers find themselves thrown together and face unexpected judgment. An American president draws inspiration from a conversation he overhears in a stable. And members of The Five-Carat Soul Bottom Bone Band recount stories from their own messy and hilarious lives. As McBride did in his National Book award-winning The Good Lord Bird and his bestselling The Color of Water, he writes with humor and insight about how we struggle to understand who we are in a world we don’t fully comprehend. The result is a surprising, perceptive, and evocative collection of stories that is also a moving exploration of our human condition.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=DehqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"A House for Mr. Biswas","author":"V. S. Naipaul","description":"In his forty-six short years, Mr. Mohun Biswas has been fighting against destiny to achieve some semblance of independence, only to face a lifetime of calamity. Shuttled from one residence to another after the drowning death of his father, for which he is inadvertently responsible, Mr. Biswas yearns for a place he can call home. But when he marries into the domineering Tulsi family on whom he indignantly becomes dependent, Mr. Biswas embarks on an arduous -- and endless -- struggle to weaken their hold over him, and purchase a house of his own.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=1A3vvT-HCfYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Florida","author":"Lauren Groff","description":"The universally-acclaimed return of the New York Times bestselling author of Fates and Furies, Matrix, and the highly-anticipated The Vaster Wilds In Lauren Groff’s Florida, the hot sun shines, but a wild darkness lurks. Florida is a \"superlative\" book (Boston Globe), \"gorgeously weird and limber\" (New Yorker), \"frequently funny\" (San Francisco Chronicle), \"brooding, inventive and often moving\" (NPR Fresh Air) -- as Groff is recognized as \"Florida's unofficial poet laureate, as Joan Didion was for California.\" (Washington Post) \"Groff's gifts as a writer just keep soaring higher and higher.” – NPR’s Fresh Air In her thrilling new book, Lauren Groff brings the reader into a physical world that is at once domestic and wild—a place where the hazards of the natural world lie waiting to pounce, yet the greatest threats and mysteries are still of an emotional, psychological nature. A family retreat can be derailed by a prowling panther, or by a sexual secret. Among those navigating this place are a resourceful pair of abandoned sisters; a lonely boy, grown up; a restless, childless couple, a searching, homeless woman; and an unforgettable, recurring character—a steely and conflicted wife and mother. The stories in this collection span characters, towns, decades, even centuries, but Florida—its landscape, climate, history, and state of mind—becomes its gravitational center: an energy, a mood, as much as a place of residence. Groff transports the reader, then jolts us alert with a crackle of wit, a wave of sadness, a flash of cruelty, as she writes about loneliness, rage, family, and the passage of time. With shocking accuracy and effect, she pinpoints the moments and decisions and connections behind human pleasure and pain, hope and despair, love and fury—the moments that make us alive. Startling, precise, and affecting, Florida is a magnificent achievement.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=B1-UDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"How to Read the Air","author":"Dinaw Mengestu","description":"A \"beautifully written\"* (New York Times Book Review) novel of redemption by a prize-winning international literary star. From the acclaimed author of The Beautiful Things that Heaven Bears comes a heartbreaking literary masterwork about love, family, and the power of imagination. Following the death of his father Yosef, Jonas Woldemariam feels compelled to make sense of the volatile generational and cultural ties that have forged him. Leaving behind his marriage and job in New York, he sets out to retrace his mother and father's honeymoon as young Ethiopian immigrants and weave together a family history that will take him from the war-torn country of his parents' youth to a brighter vision of his life in America today. In so doing, he crafts a story- real or invented-that holds the possibility of reconciliation and redemption.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=KBFcMJ82jXIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Washington Black","author":"Esi Edugyan","description":"ONE OF THE NEW YORK TIMES BOOK REVIEW'S TEN BEST BOOKS OF THE YEAR • MAN BOOKER PRIZE FINALIST • “A gripping historical narrative exploring both the bounds of slavery and what it means to be truly free.” —Vanity Fair Eleven-year-old George Washington Black—or Wash—a field slave on a Barbados sugar plantation, is initially terrified when he is chosen as the manservant of his master’s brother. To his surprise, however, the eccentric Christopher Wilde turns out to be a naturalist, explorer, inventor, and abolitionist. Soon Wash is initiated into a world where a flying machine can carry a man across the sky, where even a boy born in chains may embrace a life of dignity and meaning, and where two people, separated by an impossible divide, can begin to see each other as human. But when a man is killed and a bounty is placed on Wash’s head, they must abandon everything and flee together. Over the course of their travels, what brings Wash and Christopher together will tear them apart, propelling Wash ever farther across the globe in search of his true self. Spanning the Caribbean to the frozen Far North, London to Morocco, Washington Black is a story of self-invention and betrayal, of love and redemption, and of a world destroyed and made whole again.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=XNRGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Lot","author":"Bryan Washington","description":"One of Barack Obama’s “Favorite Books of the Year” \"Phenomenal\" --Justin Torres, author of We the Animals \"Brilliant\" --Nicole Dennis-Benn, author of Here Comes the Sun “A profound exploration of the true meaning of borders.” —The New York Times Book Review NAMED ONE OF THE 10 BEST BOOKS OF 2019 in the New York Times by Dwight Garner A New York Times Notable Book of 2019 In the city of Houston - a sprawling, diverse microcosm of America - the son of a black mother and a Latino father is coming of age. He's working at his family's restaurant, weathering his brother's blows, resenting his older sister's absence. And discovering he likes boys. Around him, others live and thrive and die in Houston's myriad neighborhoods: a young woman whose affair detonates across an apartment complex, a ragtag baseball team, a group of young hustlers, hurricane survivors, a local drug dealer who takes a Guatemalan teen under his wing, a reluctant chupacabra. Bryan Washington's brilliant, viscerally drawn world vibrates with energy, wit, raw power, and the infinite longing of people searching for home. With soulful insight into what makes a community, a family, and a life, Lot explores trust and love in all its unsparing and unsteady forms.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=xrNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Anything Is Possible","author":"Elizabeth Strout","description":"NEW YORK TIMES BESTSELLER • An unforgettable cast of small-town characters copes with love and loss in this “compulsively readable” (San Francisco Chronicle) novel from #1 bestselling author and Pulitzer Prize winner Elizabeth Strout “This book, this writer, are magnificent.”—Ann Patchett Winner of The Story Prize • A Washington Post and New York Times Notable Book • One of USA Today’s top 10 books of the year Recalling Olive Kitteridge in its richness, structure, and complexity, Anything Is Possible explores the whole range of human emotion through the intimate dramas of people struggling to understand themselves and others. Here are two sisters: One trades self-respect for a wealthy husband while the other finds in the pages of a book a kindred spirit who changes her life. The janitor at the local school has his faith tested in an encounter with an isolated man he has come to help; a grown daughter longs for mother love even as she comes to accept her mother’s happiness in a foreign country; and the adult Lucy Barton (the heroine of My Name Is Lucy Barton, the author’s celebrated New York Times bestseller) returns to visit her siblings after seventeen years of absence. Reverberating with the deep bonds of family, and the hope that comes with reconciliation, Anything Is Possible again underscores Elizabeth Strout’s place as one of America’s most respected and cherished authors.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=nJJPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Inland","author":"Téa Obreht","description":"NEW YORK TIMES BESTSELLER • The bestselling author of The Tiger’s Wife returns with “a bracingly epic and imaginatively mythic journey across the American West” (Entertainment Weekly). NAMED ONE OF THE BEST BOOKS OF THE YEAR BY Time • The Washington Post • Entertainment Weekly • Esquire • Real Simple • Good Housekeeping • Town & Country • The New York Public Library • Kirkus Reviews • Library Journal • BookPage In the lawless, drought-ridden lands of the Arizona Territory in 1893, two extraordinary lives unfold. Nora is an unflinching frontierswoman awaiting the return of the men in her life—her husband, who has gone in search of water for the parched household, and her elder sons, who have vanished after an explosive argument. Nora is biding her time with her youngest son, who is convinced that a mysterious beast is stalking the land around their home. Meanwhile, Lurie is a former outlaw and a man haunted by ghosts. He sees lost souls who want something from him, and he finds reprieve from their longing in an unexpected relationship that inspires a momentous expedition across the West. The way in which Lurie’s death-defying trek at last intersects with Nora’s plight is the surprise and suspense of this brilliant novel. Mythical, lyrical, and sweeping in scope, Inland is grounded in true but little-known history. It showcases all of Téa Obreht’s talents as a writer, as she subverts and reimagines the myths of the American West, making them entirely—and unforgettably—her own. Praise for Inland “As it should be, the landscape of the West itself is a character, thrillingly rendered throughout. . . . Here, Obreht’s simple but rich prose captures and luxuriates in the West’s beauty and sudden menace. Remarkable in a novel with such a sprawling cast, Obreht also has a poetic touch for writing intricate and precise character descriptions.”—The New York Times Book Review (Editors’ Choice) “Beautifully wrought.”—Vanity Fair “Obreht is the kind of writer who can forever change the way you think about a thing, just through her powers of description. . . . Inland is an ambitious and beautiful work about many things: immigration, the afterlife, responsibility, guilt, marriage, parenthood, revenge, all the roads and waterways that led to America. Miraculously, it’s also a page-turner and a mystery, as well as a love letter to a camel, and, like a camel, improbable and splendid, something to happily puzzle over at first and take your breath away at the end.”—Elizabeth McCracken, O: The Oprah Magazine","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=4jTgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Topeka School","author":"Ben Lerner","description":"FINALIST FOR THE PULITZER PRIZE WINNER OF THE LOS ANGELES TIMES BOOK PRIZE ONE OF THE NEW YORK TIMES TOP TEN BOOKS OF THE YEAR A TIME, GQ, Vulture, and WASHINGTON POST TOP 10 BOOK of the YEAR ONE OF BARACK OBAMA'S FAVORITE BOOKS OF THE YEAR Finalist for the National Book Critics Circle Award Shortlisted for the Rathbones Folio Prize Winner of the Hefner Heitz Kansas Book Award ALSO NAMED ONE OF THE BEST BOOKS OF THE YEAR BY: Esquire, NPR, Vogue, Amazon, Kirkus, The Times (UK), Buzzfeed, Vanity Fair, The Telegraph (UK), Financial Times (UK), Lit Hub, The Times Literary Supplement (UK), The New York Post, Daily Mail (UK), The Atlantic, Publishers Weekly, The Guardian (UK), Electric Literature, SPY.com, and the New York Public Library From the award-winning author of 10:04 and Leaving the Atocha Station, a tender and expansive family drama set in the American Midwest at the turn of the century: a tale of adolescence, transgression, and the conditions that have given rise to the trolls and tyrants of the New Right Adam Gordon is a senior at Topeka High School, class of ’97. His mother, Jane, is a famous feminist author; his father, Jonathan, is an expert at getting “lost boys” to open up. They both work at a psychiatric clinic that has attracted staff and patients from around the world. Adam is a renowned debater, expected to win a national championship before he heads to college. He is one of the cool kids, ready to fight or, better, freestyle about fighting if it keeps his peers from thinking of him as weak. Adam is also one of the seniors who bring the loner Darren Eberheart—who is, unbeknownst to Adam, his father’s patient—into the social scene, to disastrous effect. Deftly shifting perspectives and time periods, The Topeka School is the story of a family, its struggles and its strengths: Jane’s reckoning with the legacy of an abusive father, Jonathan’s marital transgressions, the challenge of raising a good son in a culture of toxic masculinity. It is also a riveting prehistory of the present: the collapse of public speech, the trolls and tyrants of the New Right, and the ongoing crisis of identity among white men.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=8ZqEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Sing, Unburied, Sing","author":"Jesmyn Ward","description":"\"A searing and profound Southern odyssey through Mississippi's past and present\"--","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=DiszDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Shadow of Sirius","author":"William Stanley Merwin","description":"US Poet Laureate W.S. Merwin was arguably the most influential American poet of the last half-century - an artist who transfigured and reinvigorated the vision of poetry for our time. Bloodaxe published his Selected Poems in 2007. At 82, Merwin produced 'his best book in a decade - and one of the best outright' (Publishers Weekly), and a collection which has won him his second Pulitzer Prize in the US and a Poetry Book Society Recommendation in the UK. The nuanced mysteries of light, darkness, presence, and memory are central themes in his latest collection. 'I have only what I remember,' Merwin admits, and his memories are focused and profound-the distinct qualities of autumn light, a conversation with a boyhood teacher, well-cultivated loves, and 'our long evenings and astonishment'. In 'Photographer', Merwin presents the scene where armloads of antique glass negatives are saved from a dumpcart by 'someone who understood'. In 'Empty Lot', Merwin evokes a child lying in bed at night, listening to the muffled dynamite blasts of coal mining near his home, and we can't help but ask: How shall we mine our lives?","categories":["American poetry"],"coverImage":"http://books.google.com/books/content?id=i7_bjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Pattern Recognition","author":"William Gibson","description":"“Pattern Recognition is William Gibson’s best book since he rewrote all the rules in Neuromancer.”—Neil Gaiman, author of American Gods “One of the first authentic and vital novels of the 21st century.”—The Washington Post Book World The accolades and acclaim are endless for William Gibson's coast-to-coast bestseller. Set in the post-9/11 present, Pattern Recognition is the story of one woman's never-ending search for the now... Cayce Pollard is a new kind of prophet—a world-renowned “coolhunter” who predicts the hottest trends. While in London to evaluate the redesign of a famous corporate logo, she’s offered a different assignment: find the creator of the obscure, enigmatic video clips being uploaded to the internet—footage that is generating massive underground buzz worldwide. Still haunted by the memory of her missing father—a Cold War security guru who disappeared in downtown Manhattan on the morning of September 11, 2001—Cayce is soon traveling through parallel universes of marketing, globalization, and terror, heading always for the still point where the three converge. From London to Tokyo to Moscow, she follows the implications of a secret as disturbing—and compelling—as the twenty-first century promises to be...","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=M4juDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Neuromancer","author":"William Gibson","description":"Winner of the Hugo, Nebula, and Philip K. Dick Awards, Neuromancer is a science fiction masterpiece—a classic that ranks as one of the twentieth century’s most potent visions of the future. Case was the sharpest data-thief in the matrix—until he crossed the wrong people and they crippled his nervous system, banishing him from cyberspace. Now a mysterious new employer has recruited him for a last-chance run at an unthinkably powerful artificial intelligence. With a dead man riding shotgun and Molly, a mirror-eyed street-samurai, to watch his back, Case is ready for the adventure that upped the ante on an entire genre of fiction. Neuromancer was the first fully-realized glimpse of humankind’s digital future—a shocking vision that has challenged our assumptions about technology and ourselves, reinvented the way we speak and think, and forever altered the landscape of our imaginations.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=IDFfMPW32hQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Night Sky with Exit Wounds","author":"Ocean Vuong","description":"Winner of the 2017 T. S. Eliot Prize 'Reading Vuong is like watching a fish move- he manages the varied currents of English with muscled intuition.' New Yorker An extraordinary debut from a young Vietnamese American, Night Sky with Exit Wounds is a book of poetry unlike any other. Steeped in war and cultural upheaval and wielding a fresh new language, Vuong writes about the most profound subjects - love and loss, conflict, grief, memory and desire - and attends to them all with lines that feel newly-minted, graceful in their cadences, passionate and hungry in their tender, close attention- '...the chief of police/facedown in a pool of Coca-Cola./A palm-sized photo of his father soaking/beside his left ear.' This is an unusual, important book- both gentle and visceral, vulnerable and assured, and its blend of humanity and power make it one of the best first collections of poetry to come out of America in years. 'These are poems of exquisite beauty, unashamed of romance, and undaunted by looking directly into the horrors of war, the silences of history. One of the most important debut collections for a generation.' Andrew McMillan Winner of the 2017 Felix Dennis Prize for Best First Collection A Guardian / Daily Telegraph Book of the Year PBS Summer Recommendation","categories":["American poetry"],"coverImage":"http://books.google.com/books/content?id=J5tQvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Zorba the Greek","author":"Nikos Kazantzakis","description":"The classic novel, international sensation, and inspiration for the film starring Anthony Quinn explores the struggle between the aesthetic and the rational, the inner life and the life of the mind. The classic novel Zorba the Greek is the story of two men, their incredible friendship, and the importance of living life to the fullest. Zorba, a Greek working man, is a larger-than-life character, energetic and unpredictable. He accompanies the unnamed narrator to Crete to work in the narrator’s lignite mine, and the pair develops a singular relationship. The two men couldn’t be further apart: The narrator is cerebral, modest, and reserved; Zorba is unfettered, spirited, and beyond the reins of civility. Over the course of their journey, he becomes the narrator’s greatest friend and inspiration and helps him to appreciate the joy of living. Zorba has been acclaimed as one of the most remarkable figures in literature; he is a character in the great tradition of Sinbad the Sailor, Falstaff, and Sancho Panza. He responds to all that life offers him with passion, whether he’s supervising laborers at a mine, confronting mad monks in a mountain monastery, embellishing the tales of his past adventures, or making love. Zorba the Greek explores the beauty and pain of existence, inviting readers to reevaluate the most important aspects of their lives and live to the fullest.","categories":["Fiction"],"coverImage":"http://books.google.com/books/content?id=72iabSl3b78C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Death of a Salesman","author":"Arthur Miller","description":"The Pulitzer Prize-winning tragedy of a salesman’s deferred American dream, presented here with enlightening commentary and criticism Willy Loman, the protagonist of Death of a Salesman, has spent his life following the American way, living out his belief in salesmanship as a way to reinvent himself. But somehow the riches and respect he covets have eluded him. At age 63, he searches for the moment his life took a wrong turn, the moment of betrayal that undermined his relationship with his wife and destroyed his relationship with Biff, the son in whom he invested his faith. Willy lives in a fragile world of elaborate excuses and daydreams, conflating past and present in a desperate attempt to make sense of himself and of a world that once promised so much. Since it was first performed in 1949, Arthur Miller's Pulitzer Prize-winning drama about the tragic shortcomings of an American dreamer has been recognized as a milestone of the theater. This Viking Critical Library edition of Death of a Salesman contains the complete text of the play, typescript facsimiles, and extensive critical and contextual material including: Conflicting reviews about its opening night by Robert Garland, Harold Clurman, Eleanor Clark, and others Five articles by Miller on his play, including \"Tragedy and the Common Man\" and his \"Introduction to Collected Plays\" Critical essays by John Gassner, Ivor Brown, Joseph A. Hynes, and others General essays on Miller by William Weigand, Allan Seager, and others Analogous works by Eudora Welty, Walter D. Moody, Tennessee Williams, and Irwin Shaw The stage designer's account, presented in selections from Designing for the Theatre by Jo Mielziner An in-depth introduction by the editor, a chronology, a list of topics for discussion and papers, and a bibliography","categories":["Drama"],"coverImage":"http://books.google.com/books/content?id=4IRPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Neverending Story","author":"Michael Ende","description":"Read the book that inspired the classic coming-of-age film before it's back onscreen in select theaters this September! From award-winning German author Michael Ende, The Neverending Story is a classic tale of one boy and the book that magically comes to life. When Bastian happens upon an old book called The Neverending Story, he's swept into the magical world of Fantastica--so much that he finds he has actually become a character in the story! And when he realizes that this mysteriously enchanted world is in great danger, he also discovers that he is the one chosen to save it. Can Bastian overcome the barrier between reality and his imagination in order to save Fantastica? \"An instantaneous leap into the magical . . . Energetic, innovative, and perceptive\"—The Washington Post \"A trumpet blast for the imagination.\"—Sunday Times","categories":["Juvenile Fiction"],"coverImage":"http://books.google.com/books/content?id=GxRUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}]